#pragma once

// PUBG FULL SDK - Generated By Respecter (5.3.4.11 [06/03/2019]) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "PUBG_Basic.hpp"
#include "PUBG_PhysXVehicles_classes.hpp"
#include "PUBG_AnimGraphRuntime_classes.hpp"
#include "PUBG_Engine_classes.hpp"
#include "PUBG_AIModule_classes.hpp"
#include "PUBG_CoreUObject_classes.hpp"
#include "PUBG_CustomizableObject_classes.hpp"
#include "PUBG_InputCore_classes.hpp"
#include "PUBG_UMG_classes.hpp"
#include "PUBG_SlateCore_classes.hpp"
#include "PUBG_GameplayTasks_classes.hpp"
#include "PUBG_Slate_classes.hpp"
#include "PUBG_OceanPlugin_classes.hpp"
#include "PUBG_CoherentUIGTPlugin_classes.hpp"
#include "PUBG_EngineSettings_classes.hpp"
#include "PUBG_OnlineSubsystemUtils_classes.hpp"
#include "PUBG_TslCommon_classes.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum TslGame.EPopupButtonID
enum class EPopupButtonID : uint8_t
{
	EPopupButtonID__Cancel_Or_No   = 0,
	EPopupButtonID__Yes_Or_OK      = 1,
	EPopupButtonID__EPopupButtonID_MAX = 2
};


// Enum TslGame.ESystemMessageType
enum class ESystemMessageType : uint8_t
{
	ESystemMessageType__Debug      = 0,
	ESystemMessageType__Notify     = 1,
	ESystemMessageType__Warning    = 2,
	ESystemMessageType__Error      = 3,
	ESystemMessageType__Important  = 4,
	ESystemMessageType__ESystemMessageType_MAX = 5
};


// Enum TslGame.EDamageReason
enum class EDamageReason : uint8_t
{
	EDamageReason__None            = 0,
	EDamageReason__HeadShot        = 1,
	EDamageReason__TorsoShot       = 2,
	EDamageReason__PelvisShot      = 3,
	EDamageReason__ArmShot         = 4,
	EDamageReason__LegShot         = 5,
	EDamageReason__NonSpecific     = 6,
	EDamageReason__EDamageReason_MAX = 7
};


// Enum TslGame.EDamageTypeCategory
enum class EDamageTypeCategory : uint8_t
{
	EDamageTypeCategory__Damage_None = 0,
	EDamageTypeCategory__Damage_Instant = 1,
	EDamageTypeCategory__Damage_Gun = 2,
	EDamageTypeCategory__Damage_Melee = 3,
	EDamageTypeCategory__Damage_Punch = 4,
	EDamageTypeCategory__Damage_ZombiePunch = 5,
	EDamageTypeCategory__Damage_Groggy = 6,
	EDamageTypeCategory__Damage_BlueZone = 7,
	EDamageTypeCategory__Damage_VehicleHit = 8,
	EDamageTypeCategory__Damage_VehicleCrashHit = 9,
	EDamageTypeCategory__Damage_Molotov = 10,
	EDamageTypeCategory__Damage_Explosion = 11,
	EDamageTypeCategory__Damage_Explosion_Grenade = 12,
	EDamageTypeCategory__Damage_Explosion_RedZone = 13,
	EDamageTypeCategory__Damage_Explosion_Vehicle = 14,
	EDamageTypeCategory__Damage_Instant_Fall = 15,
	EDamageTypeCategory__Damage_Drown = 16,
	EDamageTypeCategory__Damage_BleedOut = 17,
	EDamageTypeCategory__Damage_MAX = 18
};


// Enum TslGame.EWeaponAttachmentSlotID
enum class EWeaponAttachmentSlotID : uint8_t
{
	EWeaponAttachmentSlotID__None  = 0,
	EWeaponAttachmentSlotID__Muzzle = 1,
	EWeaponAttachmentSlotID__LowerRail = 2,
	EWeaponAttachmentSlotID__UpperRail = 3,
	EWeaponAttachmentSlotID__Magazine = 4,
	EWeaponAttachmentSlotID__Stock = 5,
	EWeaponAttachmentSlotID__Angled = 6,
	EWeaponAttachmentSlotID__EWeaponAttachmentSlotID_MAX = 7
};


// Enum TslGame.ETslOvercastAction
enum class ETslOvercastAction : uint8_t
{
	ETslOvercastAction__Initialized = 0,
	ETslOvercastAction__Prolonged  = 1,
	ETslOvercastAction__CreateThunder = 2,
	ETslOvercastAction__ETslOvercastAction_MAX = 3
};


// Enum TslGame.EServerStatType
enum class EServerStatType : uint8_t
{
	UE                             = 0,
	NET                            = 1,
	EServerStatType_MAX            = 2
};


// Enum TslGame.ERatingRankType
enum class ERatingRankType : uint8_t
{
	ERatingRankType__None          = 0,
	ERatingRankType__Bronze        = 1,
	ERatingRankType__Silver        = 2,
	ERatingRankType__Gold          = 3,
	ERatingRankType__Platinum      = 4,
	ERatingRankType__Diamond       = 5,
	ERatingRankType__Elite         = 6,
	ERatingRankType__Master        = 7,
	ERatingRankType__GrandMaster   = 8,
	ERatingRankType__ERatingRankType_MAX = 9
};


// Enum TslGame.EThrownWeaponType
enum class EThrownWeaponType : uint8_t
{
	EThrownWeaponType__Thrown_Grenade = 0,
	EThrownWeaponType__Thrown_Molotov = 1,
	EThrownWeaponType__Thrown_Other = 2,
	EThrownWeaponType__Thrown_MAX  = 3
};


// Enum TslGame.EPowerUpType
enum class EPowerUpType : uint8_t
{
	PowerUp_None                   = 0,
	Powerup_Bandage                = 1,
	PowerUp_FirstAid               = 2,
	Powerup_Medkit                 = 3,
	PowerUp_EnergyDrink            = 4,
	Powerup_Painkillers            = 5,
	PowerUp_Adrenaline             = 6,
	PowerUp_MAX                    = 7,
	EPowerUpType_MAX               = 8
};


// Enum TslGame.ECastAnim
enum class ECastAnim : uint8_t
{
	ECastAnim__None                = 0,
	ECastAnim__Bandage             = 1,
	ECastAnim__FirstAid            = 2,
	ECastAnim__Medkit              = 3,
	ECastAnim__EnergyDrink         = 4,
	ECastAnim__Painkiller          = 5,
	ECastAnim__Adrenaline          = 6,
	ECastAnim__Door                = 7,
	ECastAnim__ECastAnim_MAX       = 8
};


// Enum TslGame.ECharacterNegativeEffects
enum class ECharacterNegativeEffects : uint8_t
{
	ECharacterNegativeEffects__Blind = 0,
	ECharacterNegativeEffects__Burning = 1,
	ECharacterNegativeEffects__Total = 2,
	ECharacterNegativeEffects__ECharacterNegativeEffects_MAX = 3
};


// Enum TslGame.ESubjectToReport
enum class ESubjectToReport : uint8_t
{
	ESubjectToReport__None         = 0,
	ESubjectToReport__Killer       = 1,
	ESubjectToReport__Spectating_Player = 2,
	ESubjectToReport__Replay_Player = 3,
	ESubjectToReport__Team_Member  = 4,
	ESubjectToReport__ESubjectToReport_MAX = 5
};


// Enum TslGame.EWelcomeState
enum class EWelcomeState : uint8_t
{
	EWelcomeState__CopyrightAndWarning = 0,
	EWelcomeState__PressAKey       = 1,
	EWelcomeState__NowLoading      = 2,
	EWelcomeState__EWelcomeState_MAX = 3
};


// Enum TslGame.EMovementDirection
enum class EMovementDirection : uint8_t
{
	EMovementDirection__F_Direction = 0,
	EMovementDirection__L_Direction = 1,
	EMovementDirection__R_Direction = 2,
	EMovementDirection__B_Direction = 3,
	EMovementDirection__FL_Direction = 4,
	EMovementDirection__FR_Direction = 5,
	EMovementDirection__BL_Direction = 6,
	EMovementDirection__BR_Direction = 7,
	EMovementDirection__EMovementDirection_MAX = 8
};


// Enum TslGame.EAnimStanceType
enum class EAnimStanceType : uint8_t
{
	AnimType_Stand                 = 0,
	AnimType_Crouch                = 1,
	AnimType_Prone                 = 2,
	AnimType_MAX                   = 3
};


// Enum TslGame.EAnimStance
enum class EAnimStance : uint8_t
{
	EAnimStance__Stand             = 0,
	EAnimStance__Crouch            = 1,
	EAnimStance__Prone             = 2,
	EAnimStance__Groggy            = 3,
	EAnimStance__EAnimStance_MAX   = 4
};


// Enum TslGame.EAttackType
enum class EAttackType : uint8_t
{
	EAttackType__None              = 0,
	EAttackType__Weapon            = 1,
	EAttackType__VehicleCrash      = 2,
	EAttackType__VehicleExplosion  = 3,
	EAttackType__Fall              = 4,
	EAttackType__BlueZone          = 5,
	EAttackType__RedZone           = 6,
	EAttackType__EAttackType_MAX   = 7
};


// Enum TslGame.EPlayerMoveType
enum class EPlayerMoveType : uint8_t
{
	EPlayerMoveType__OnFoot        = 0,
	EPlayerMoveType__OnSwim        = 1,
	EPlayerMoveType__OnVehicle     = 2,
	EPlayerMoveType__OnParachute   = 3,
	EPlayerMoveType__OnFreefall    = 4,
	EPlayerMoveType__EPlayerMoveType_MAX = 5
};


// Enum TslGame.ECastableItemType
enum class ECastableItemType : uint8_t
{
	ECastableItemType__None        = 0,
	ECastableItemType__Bandage     = 1,
	ECastableItemType__FirstAid    = 2,
	ECastableItemType__Medkit      = 3,
	ECastableItemType__EnergyDrink = 4,
	ECastableItemType__Painkiller  = 5,
	ECastableItemType__Adrenaline  = 6,
	ECastableItemType__GasCan      = 7,
	ECastableItemType__ECastableItemType_MAX = 8
};


// Enum TslGame.ECastLevel
enum class ECastLevel : uint8_t
{
	ECastLevel__None               = 0,
	ECastLevel__NoRestriction      = 1,
	ECastLevel__Restriction        = 2,
	ECastLevel__ECastLevel_MAX     = 3
};


// Enum TslGame.ECastPriority
enum class ECastPriority : uint8_t
{
	ECastPriority__None            = 0,
	ECastPriority__Low             = 1,
	ECastPriority__Normal          = 2,
	ECastPriority__High            = 3,
	ECastPriority__Max             = 4,
	ECastPriority__ECastPriority_MAX = 5
};


// Enum TslGame.ELandingSoundSwitchState
enum class ELandingSoundSwitchState : uint8_t
{
	ELandingSoundSwitchState__None = 0,
	ELandingSoundSwitchState__Light = 1,
	ELandingSoundSwitchState__Heavy = 2,
	ELandingSoundSwitchState__VeryHeavy = 3,
	ELandingSoundSwitchState__ELandingSoundSwitchState_MAX = 4
};


// Enum TslGame.EBuffOverlapSolveMethod
enum class EBuffOverlapSolveMethod : uint8_t
{
	EBuffOverlapSolveMethod__IgnoreLater = 0,
	EBuffOverlapSolveMethod__Overwrite = 1,
	EBuffOverlapSolveMethod__RestartTimer = 2,
	EBuffOverlapSolveMethod__Stack = 3,
	EBuffOverlapSolveMethod__EBuffOverlapSolveMethod_MAX = 4
};


// Enum TslGame.ETslControllerType
enum class ETslControllerType : uint8_t
{
	ETslControllerType__Mouse      = 0,
	ETslControllerType__GamePad    = 1,
	ETslControllerType__Total      = 2,
	ETslControllerType__ETslControllerType_MAX = 3
};


// Enum TslGame.ELobbyItemPointSellingType
enum class ELobbyItemPointSellingType : uint8_t
{
	ELobbyItemPointSellingType__Normal = 0,
	ELobbyItemPointSellingType__WeeklyDouble = 1,
	ELobbyItemPointSellingType__ELobbyItemPointSellingType_MAX = 2
};


// Enum TslGame.ELobbyItemPlatform
enum class ELobbyItemPlatform : uint8_t
{
	ELobbyItemPlatform__PC_Steam   = 0,
	ELobbyItemPlatform__PC_NonSteam = 1,
	ELobbyItemPlatform__Xbox       = 2,
	ELobbyItemPlatform__ELobbyItemPlatform_MAX = 3
};


// Enum TslGame.ELobbyItemTier
enum class ELobbyItemTier : uint8_t
{
	ELobbyItemTier__Basic          = 0,
	ELobbyItemTier__Common         = 1,
	ELobbyItemTier__Classic        = 2,
	ELobbyItemTier__Special        = 3,
	ELobbyItemTier__Rare           = 4,
	ELobbyItemTier__Elite          = 5,
	ELobbyItemTier__Epic           = 6,
	ELobbyItemTier__Legendary      = 7,
	ELobbyItemTier__Ultimate       = 8,
	ELobbyItemTier__Event          = 9,
	ELobbyItemTier__ELobbyItemTier_MAX = 10
};


// Enum TslGame.ELobbyItemCategory
enum class ELobbyItemCategory : uint8_t
{
	ELobbyItemCategory__Belt       = 0,
	ELobbyItemCategory__Body       = 1,
	ELobbyItemCategory__Eyes       = 2,
	ELobbyItemCategory__Feet       = 3,
	ELobbyItemCategory__Head       = 4,
	ELobbyItemCategory__Jacket     = 5,
	ELobbyItemCategory__Legs       = 6,
	ELobbyItemCategory__Mask       = 7,
	ELobbyItemCategory__Hands      = 8,
	ELobbyItemCategory__Box        = 9,
	ELobbyItemCategory__Key        = 10,
	ELobbyItemCategory__WeaponSkin = 11,
	ELobbyItemCategory__ParachuteSkin = 12,
	ELobbyItemCategory__HelmetSkin = 13,
	ELobbyItemCategory__BackpackSkin = 14,
	ELobbyItemCategory__TorsoArmorSkin = 15,
	ELobbyItemCategory__Multislot  = 16,
	ELobbyItemCategory__ELobbyItemCategory_MAX = 17
};


// Enum TslGame.EItemCategory
enum class EItemCategory : uint8_t
{
	EItemCategory__None            = 0,
	EItemCategory__Equipment       = 1,
	EItemCategory__Weapon          = 2,
	EItemCategory__Attachment      = 3,
	EItemCategory__Ammunition      = 4,
	EItemCategory__Use             = 5,
	EItemCategory__Skin            = 6,
	EItemCategory__EItemCategory_MAX = 7
};


// Enum TslGame.EWeaponGripLeftHand
enum class EWeaponGripLeftHand : uint8_t
{
	EWeaponGripLeftHand__NormalRifle = 0,
	EWeaponGripLeftHand__Foregrip1 = 1,
	EWeaponGripLeftHand__Foregrip2 = 2,
	EWeaponGripLeftHand__Thompson  = 3,
	EWeaponGripLeftHand__EWeaponGripLeftHand_MAX = 4
};


// Enum TslGame.EVoiceTransmissionType
enum class EVoiceTransmissionType : uint8_t
{
	EVoiceTransmissionType__None   = 0,
	EVoiceTransmissionType__ToAll  = 1,
	EVoiceTransmissionType__ToChannel = 2,
	EVoiceTransmissionType__EVoiceTransmissionType_MAX = 3
};


// Enum TslGame.EVivoxResponseState
enum class EVivoxResponseState : uint8_t
{
	EVivoxResponseState__NotRequested = 0,
	EVivoxResponseState__Requested = 1,
	EVivoxResponseState__Fail      = 2,
	EVivoxResponseState__Success   = 3,
	EVivoxResponseState__EVivoxResponseState_MAX = 4
};


// Enum TslGame.EVoiceChannelType
enum class EVoiceChannelType : uint8_t
{
	EVoiceChannelType__None        = 0,
	EVoiceChannelType__All         = 1,
	EVoiceChannelType__GlobalOnly  = 2,
	EVoiceChannelType__TeamOnly    = 3,
	EVoiceChannelType__EVoiceChannelType_MAX = 4
};


// Enum TslGame.EVoiceChannelJoinState
enum class EVoiceChannelJoinState : uint8_t
{
	EVoiceChannelJoinState__NotJoined = 0,
	EVoiceChannelJoinState__Joining = 1,
	EVoiceChannelJoinState__Leaving = 2,
	EVoiceChannelJoinState__Joined = 3,
	EVoiceChannelJoinState__EVoiceChannelJoinState_MAX = 4
};


// Enum TslGame.EVoiceLoginState
enum class EVoiceLoginState : uint8_t
{
	EVoiceLoginState__NotLoggedin  = 0,
	EVoiceLoginState__Loggingin    = 1,
	EVoiceLoginState__Loggedin     = 2,
	EVoiceLoginState__EVoiceLoginState_MAX = 3
};


// Enum TslGame.EVoiceConnectionState
enum class EVoiceConnectionState : uint8_t
{
	EVoiceConnectionState__NotConnected = 0,
	EVoiceConnectionState__Connecting = 1,
	EVoiceConnectionState__Connected = 2,
	EVoiceConnectionState__EVoiceConnectionState_MAX = 3
};


// Enum TslGame.EBeginningState
enum class EBeginningState : uint8_t
{
	EBeginningState__Invalid       = 0,
	EBeginningState__Normal        = 1,
	EBeginningState__StartIsland   = 2,
	EBeginningState__Airplane      = 3,
	EBeginningState__Skydiving     = 4,
	EBeginningState__Parachuting   = 5,
	EBeginningState__EBeginningState_MAX = 6
};


// Enum TslGame.ETracerDisplayMode
enum class ETracerDisplayMode : uint8_t
{
	ETracerDisplayMode__TracerDM_None = 0,
	ETracerDisplayMode__TracerDM_Particle = 1,
	ETracerDisplayMode__TracerDM_Mesh = 2,
	ETracerDisplayMode__TracerDM_Billboard = 3,
	ETracerDisplayMode__TracerDM_MAX = 4
};


// Enum TslGame.EScopeType
enum class EScopeType : uint8_t
{
	EScopeType__Main               = 0,
	EScopeType__Right              = 1,
	EScopeType__Total              = 2,
	EScopeType__None               = 3,
	EScopeType__EScopeType_MAX     = 4
};


// Enum TslGame.EStatTrakState
enum class EStatTrakState : uint8_t
{
	EStatTrakState__Run            = 0,
	EStatTrakState__Locked         = 1,
	EStatTrakState__Error          = 2,
	EStatTrakState__EStatTrakState_MAX = 3
};


// Enum TslGame.ESkinApplicationType
enum class ESkinApplicationType : uint8_t
{
	ESkinApplicationType__Application_InOrder = 0,
	ESkinApplicationType__Application_Slot = 1,
	ESkinApplicationType__Application_MAX = 2
};


// Enum TslGame.ESkinMeshType
enum class ESkinMeshType : uint8_t
{
	ESkinMeshType__SkeletalMesh    = 0,
	ESkinMeshType__AsyncStaticMesh = 1,
	ESkinMeshType__StaticMesh      = 2,
	ESkinMeshType__ESkinMeshType_MAX = 3
};


// Enum TslGame.ESkinCategory
enum class ESkinCategory : uint8_t
{
	ESkinCategory__Skin_None       = 0,
	ESkinCategory__Skin_Equipment  = 1,
	ESkinCategory__Skin_Parachute  = 2,
	ESkinCategory__Skin_Weapon     = 3,
	ESkinCategory__Skin_MeleeWeapon = 4,
	ESkinCategory__Skin_Vehicle    = 5,
	ESkinCategory__Skin_MAX        = 6
};


// Enum TslGame.EVaultAnimType
enum class EVaultAnimType : uint8_t
{
	EVaultAnimType__VaultNone      = 0,
	EVaultAnimType__Vault200_Stationary = 1,
	EVaultAnimType__Vault200_Mobile = 2,
	EVaultAnimType__Vault200_Narrow = 3,
	EVaultAnimType__Vault160_Stationary = 4,
	EVaultAnimType__Vault160_Mobile = 5,
	EVaultAnimType__Vault160_Narrow = 6,
	EVaultAnimType__Vault120_Stationary = 7,
	EVaultAnimType__Vault120_Mobile = 8,
	EVaultAnimType__Vault120_Slide = 9,
	EVaultAnimType__Vault120_Narrow = 10,
	EVaultAnimType__Vault90_Stationary = 11,
	EVaultAnimType__Vault90_Mobile = 12,
	EVaultAnimType__Vault90_Slide  = 13,
	EVaultAnimType__Vault90_Narrow = 14,
	EVaultAnimType__Climb200_Stationary = 15,
	EVaultAnimType__Climb200_Mobile = 16,
	EVaultAnimType__Climb200_Slide = 17,
	EVaultAnimType__Climb200_Narrow = 18,
	EVaultAnimType__Climb160_Stationary = 19,
	EVaultAnimType__Climb160_Mobile = 20,
	EVaultAnimType__Climb160_Slide = 21,
	EVaultAnimType__Climb160_Narrow = 22,
	EVaultAnimType__Climb120_Stationary = 23,
	EVaultAnimType__Climb120_Mobile = 24,
	EVaultAnimType__Climb120_Slide = 25,
	EVaultAnimType__Climb120_Narrow = 26,
	EVaultAnimType__Climb90_Stationary = 27,
	EVaultAnimType__Climb90_Mobile = 28,
	EVaultAnimType__Climb90_Slide  = 29,
	EVaultAnimType__Climb90_Narrow = 30,
	EVaultAnimType__Vault90Roll    = 31,
	EVaultAnimType__Vault120Window = 32,
	EVaultAnimType__Vault60_Stationary = 33,
	EVaultAnimType__Vault60_Mobile = 34,
	EVaultAnimType__Vault60_Slide  = 35,
	EVaultAnimType__Vault60_Narrow = 36,
	EVaultAnimType__Climb60_Stationary = 37,
	EVaultAnimType__Climb60_Mobile = 38,
	EVaultAnimType__Climb60_Narrow = 39,
	EVaultAnimType__EVaultAnimType_MAX = 40
};


// Enum TslGame.EWeaponReloadMethod
enum class EWeaponReloadMethod : uint8_t
{
	EWeaponReloadMethod__Magazine  = 0,
	EWeaponReloadMethod__OneByOne  = 1,
	EWeaponReloadMethod__OneByOneAndClip = 2,
	EWeaponReloadMethod__EWeaponReloadMethod_MAX = 3
};


// Enum TslGame.EWeaponReloadAnimExec
enum class EWeaponReloadAnimExec : uint8_t
{
	EWeaponReloadAnimExec__Tactical = 0,
	EWeaponReloadAnimExec__Charge  = 1,
	EWeaponReloadAnimExec__Single  = 2,
	EWeaponReloadAnimExec__Loop    = 3,
	EWeaponReloadAnimExec__EWeaponReloadAnimExec_MAX = 4
};


// Enum TslGame.EWeaponState
enum class EWeaponState : uint8_t
{
	EWeaponState__Idle             = 0,
	EWeaponState__Firing           = 1,
	EWeaponState__Reloading        = 2,
	EWeaponState__EWeaponState_MAX = 3
};


// Enum TslGame.EWeaponTransitionState
enum class EWeaponTransitionState : uint8_t
{
	EWeaponTransitionState__Stable = 0,
	EWeaponTransitionState__Arming_Right = 1,
	EWeaponTransitionState__UnArming_Right = 2,
	EWeaponTransitionState__Arming_Left = 3,
	EWeaponTransitionState__UnArming_Left = 4,
	EWeaponTransitionState__EWeaponTransitionState_MAX = 5
};


// Enum TslGame.ESlotOffsetType
enum class ESlotOffsetType : uint8_t
{
	ESlotOffsetType__NoOffset      = 0,
	ESlotOffsetType__BagLevel1     = 1,
	ESlotOffsetType__BagLevel2     = 2,
	ESlotOffsetType__BagLevel3     = 3,
	ESlotOffsetType__ESlotOffsetType_MAX = 4
};


// Enum TslGame.EItemSpotGroupType
enum class EItemSpotGroupType : uint8_t
{
	EItemSpotGroupType__GroupA     = 0,
	EItemSpotGroupType__GroupB     = 1,
	EItemSpotGroupType__GroupC     = 2,
	EItemSpotGroupType__GroupD     = 3,
	EItemSpotGroupType__GroupE     = 4,
	EItemSpotGroupType__GroupF     = 5,
	EItemSpotGroupType__GroupG     = 6,
	EItemSpotGroupType__GroupH     = 7,
	EItemSpotGroupType__GroupI     = 8,
	EItemSpotGroupType__GroupJ     = 9,
	EItemSpotGroupType__EItemSpotGroupType_MAX = 10
};


// Enum TslGame.EItemSpotType
enum class EItemSpotType : uint8_t
{
	EItemSpotType__TypeA           = 0,
	EItemSpotType__TypeB           = 1,
	EItemSpotType__TypeC           = 2,
	EItemSpotType__TypeD           = 3,
	EItemSpotType__TypeE           = 4,
	EItemSpotType__TypeF           = 5,
	EItemSpotType__EItemSpotType_MAX = 6
};


// Enum TslGame.EEquipSlotID
enum class EEquipSlotID : uint8_t
{
	EEquipSlotID__Head             = 0,
	EEquipSlotID__Eyes             = 1,
	EEquipSlotID__Mask             = 2,
	EEquipSlotID__Torso            = 3,
	EEquipSlotID__TorsoArmor       = 4,
	EEquipSlotID__Outer            = 5,
	EEquipSlotID__Backpack         = 6,
	EEquipSlotID__Hands            = 7,
	EEquipSlotID__Legs             = 8,
	EEquipSlotID__Feet             = 9,
	EEquipSlotID__Belt             = 10,
	EEquipSlotID__WeaponPrimary    = 11,
	EEquipSlotID__WeaponSecondary  = 12,
	EEquipSlotID__WeaponMelee      = 13,
	EEquipSlotID__WeaponThrowable  = 14,
	EEquipSlotID__MaxOrNone        = 15,
	EEquipSlotID__EEquipSlotID_MAX = 16
};


// Enum TslGame.ECheatType
enum class ECheatType : uint8_t
{
	SpeedHack                      = 0,
	SpeedHack_UE                   = 1,
	IgnoreWall_Hit                 = 2,
	IgnoreWall_Sight               = 3,
	ItemPackage                    = 4,
	CarePackageMount               = 5,
	HitLag                         = 6,
	Aimbot                         = 7,
	InvalidImpact                  = 8,
	InvalidImpactZ                 = 9,
	InvalidImpact_Gun_C            = 10,
	InvalidOrigin_Gun              = 11,
	InvalidOrigin_Melee            = 12,
	InvalidOrigin_Punch            = 13,
	InvalidOrigin_Throwable        = 14,
	InvalidRange                   = 15,
	InvalidRange2                  = 16,
	InvalidSequence                = 17,
	InvalidAmmo                    = 18,
	InvalidReviving                = 19,
	InvalidKick                    = 20,
	InvalidA0                      = 21,
	InvalidB0                      = 22,
	InvalidB1                      = 23,
	InvalidB101                    = 24,
	InvalidH0                      = 25,
	InvalidOrigin_Gun_C            = 26,
	InvalidD0                      = 27,
	InvalidD1                      = 28,
	InvalidS0                      = 29,
	InvalidS1                      = 30,
	InvalidH1                      = 31,
	InvalidH2                      = 32,
	InvalidH3                      = 33,
	InvalidC0                      = 34,
	InvalidC1                      = 35,
	InvalidC2                      = 36,
	InvalidC3                      = 37,
	InvalidC4                      = 38,
	InvalidC5                      = 39,
	InvalidC6                      = 40,
	InvalidC7                      = 41,
	InvalidT0                      = 42,
	InvalidT1                      = 43,
	CHKSUM_GUN                     = 44,
	CHKSUM_PUNCH                   = 45,
	CHKSUM_MELEE                   = 46,
	CHKSUM_VEHICLE                 = 47,
	CHKSUM_A0                      = 48,
	CHKSUM_T0                      = 49,
	CHKSUM_S0                      = 50,
	CHKSUM_D0                      = 51,
	CHKSUM_V0                      = 52,
	CHKSUM_W0                      = 53,
	CHKSUM_T1                      = 54,
	CHKSUM_D1                      = 55,
	CHKSUM_CD                      = 56,
	CHKSUM_LC                      = 57,
	CHKSUM_V1                      = 58,
	CHKSUM_P0                      = 59,
	CHKSUM_BP                      = 60,
	CHKSUM_G0                      = 61,
	CHKSUM_G1                      = 62,
	VHC_RI                         = 63,
	VHC_SC                         = 64,
	VHC_MG                         = 65,
	VHC_MG_FF                      = 66,
	VHC_MG_FC                      = 67,
	VHC_MG_SW                      = 68,
	VHC_MG_OS                      = 69,
	VHC_MG_BC                      = 70,
	VHC_MGB                        = 71,
	VHC_MGB_FF                     = 72,
	VHC_MGB_FC                     = 73,
	VHC_MGB_OS                     = 74,
	VHC_MGB_BC                     = 75,
	VHC_KILL                       = 76,
	VHC_ED                         = 77,
	CP_RZ                          = 78,
	CP_RZD                         = 79,
	KGB_FP                         = 80,
	KGB_AF                         = 81,
	KGB_AH                         = 82,
	KGB_AH_NA                      = 83,
	ESP1                           = 84,
	ESP2                           = 85,
	ESP3                           = 86,
	SimilarHit                     = 87,
	DoubleKill                     = 88,
	B0Log                          = 89,
	ECheatType_MAX                 = 90
};


// Enum TslGame.EEmoteAnimType
enum class EEmoteAnimType : uint8_t
{
	EEmoteAnimType__EmoteFullBody  = 0,
	EEmoteAnimType__EmoteUpperBody = 1,
	EEmoteAnimType__EmoteArm       = 2,
	EEmoteAnimType__EEmoteAnimType_MAX = 3
};


// Enum TslGame.EConstraintSlotType
enum class EConstraintSlotType : uint8_t
{
	EConstraintSlotType__Block     = 0,
	EConstraintSlotType__Hide      = 1,
	EConstraintSlotType__Max       = 2,
	EConstraintSlotType__EConstraintSlotType_MAX = 3
};


// Enum TslGame.EDurabilityConsumeType
enum class EDurabilityConsumeType : uint8_t
{
	EDurabilityConsumeType__TotalDamage = 0,
	EDurabilityConsumeType__AbsorbDamage = 1,
	EDurabilityConsumeType__EDurabilityConsumeType_MAX = 2
};


// Enum TslGame.EParachuteLandingSurfaceType
enum class EParachuteLandingSurfaceType : uint8_t
{
	EParachuteLandingSurfaceType__Surface_None = 0,
	EParachuteLandingSurfaceType__Surface_Vertical = 1,
	EParachuteLandingSurfaceType__Surface_Horizontal = 2,
	EParachuteLandingSurfaceType__Surface_MAX = 3
};


// Enum TslGame.ELoadingScreenType
enum class ELoadingScreenType : uint8_t
{
	ELoadingScreenType__NONE       = 0,
	ELoadingScreenType__ICE_BRAKE  = 1,
	ELoadingScreenType__RULE_SET   = 2,
	ELoadingScreenType__WEAPON     = 3,
	ELoadingScreenType__ATTACHMENT = 4,
	ELoadingScreenType__EQUIPMENT  = 5,
	ELoadingScreenType__ITEM       = 6,
	ELoadingScreenType__VEHICLE    = 7,
	ELoadingScreenType__SYSTEM     = 8,
	ELoadingScreenType__DEFAULT    = 9,
	ELoadingScreenType__EXPOSE_WITH_HIGHEST_PRIORITY = 10,
	ELoadingScreenType__ELoadingScreenType_MAX = 11
};


// Enum TslGame.EHitDirection
enum class EHitDirection : uint8_t
{
	EHitDirection__Hit_Front       = 0,
	EHitDirection__Hit_Back        = 1,
	EHitDirection__Hit_Left        = 2,
	EHitDirection__Hit_Right       = 3,
	EHitDirection__Hit_MAX         = 4
};


// Enum TslGame.ECharFlagsNormal
enum class ECharFlagsNormal : uint8_t
{
	ECharFlagsNormal__IsGroggying  = 0,
	ECharFlagsNormal__IsActiveRagdollActive = 1,
	ECharFlagsNormal__HasShieldEquipped = 2,
	ECharFlagsNormal__IsBurning    = 3,
	ECharFlagsNormal__IsFlashed    = 4,
	ECharFlagsNormal__ECharFlagsNormal_MAX = 5
};


// Enum TslGame.ECharFlagsSkipOwner
enum class ECharFlagsSkipOwner : uint8_t
{
	ECharFlagsSkipOwner__WantsToRun = 0,
	ECharFlagsSkipOwner__WantsToSprint = 1,
	ECharFlagsSkipOwner__WantsToSprintingAuto = 2,
	ECharFlagsSkipOwner__WantsToRollingLeft = 3,
	ECharFlagsSkipOwner__WantsToRollingRight = 4,
	ECharFlagsSkipOwner__AimStateActive = 5,
	ECharFlagsSkipOwner__IsThirdPerson = 6,
	ECharFlagsSkipOwner__IsReviving = 7,
	ECharFlagsSkipOwner__IgnoreRotation = 8,
	ECharFlagsSkipOwner__IsWeaponObstructed = 9,
	ECharFlagsSkipOwner__IsCoatEquipped = 10,
	ECharFlagsSkipOwner__IsThrowHigh = 11,
	ECharFlagsSkipOwner__WantsToCancelVault = 12,
	ECharFlagsSkipOwner__IsScopingRemote = 13,
	ECharFlagsSkipOwner__IsAimingRemote = 14,
	ECharFlagsSkipOwner__IsFirstPersonRemote = 15,
	ECharFlagsSkipOwner__IsInVehicleRemote = 16,
	ECharFlagsSkipOwner__IsPeekLeftRemote = 17,
	ECharFlagsSkipOwner__IsPeekRightRemote = 18,
	ECharFlagsSkipOwner__IsHoldingAngled = 19,
	ECharFlagsSkipOwner__ECharFlagsSkipOwner_MAX = 20
};


// Enum TslGame.EPunchDamageType
enum class EPunchDamageType : uint8_t
{
	PunchDamage_Light              = 0,
	PunchDamage_Heavy              = 1,
	PunchDamage_MAX                = 2
};


// Enum TslGame.EMovementType
enum class EMovementType : uint8_t
{
	M_StandWalk                    = 0,
	M_StandRun                     = 1,
	M_StandSprint                  = 2,
	M_CrouchWalk                   = 3,
	M_CrouchRun                    = 4,
	M_CrouchSprint                 = 5,
	M_ProneWalk                    = 6,
	M_ProneRun                     = 7,
	M_ProneSprint                  = 8,
	M_StandScope                   = 9,
	M_CrouchScope                  = 10,
	M_ProneScope                   = 11,
	M_StandAim                     = 12,
	M_CrouchAim                    = 13,
	M_ProneAim                     = 14,
	M_Swim                         = 15,
	M_UnderwaterSwim               = 16,
	M_DBNO                         = 17,
	M_MAX                          = 18
};


// Enum TslGame.EPreoccupiedTeamType
enum class EPreoccupiedTeamType : uint8_t
{
	EPreoccupiedTeamType__NEUTRAL  = 0,
	EPreoccupiedTeamType__RED      = 1,
	EPreoccupiedTeamType__BLUE     = 2,
	EPreoccupiedTeamType__EPreoccupiedTeamType_MAX = 3
};


// Enum TslGame.ECaptureState
enum class ECaptureState : uint8_t
{
	ECaptureState__ENeutural       = 0,
	ECaptureState__EConfusion      = 1,
	ECaptureState__ECaptured       = 2,
	ECaptureState__ECaptureState_MAX = 3
};


// Enum TslGame.EFlareDeploymentType
enum class EFlareDeploymentType : uint8_t
{
	EFlareDeploymentType__Deploy_None = 0,
	EFlareDeploymentType__Deploy_InWhite = 1,
	EFlareDeploymentType__Deploy_InBlue = 2,
	EFlareDeploymentType__Deploy_Outside = 3,
	EFlareDeploymentType__Deploy_MAX = 4
};


// Enum TslGame.EAttachParent
enum class EAttachParent : uint8_t
{
	EAttachParent__None            = 0,
	EAttachParent__Character       = 1,
	EAttachParent__WeaponGun       = 2,
	EAttachParent__EAttachParent_MAX = 3
};


// Enum TslGame.ETslGameOptionKeyBindingType
enum class ETslGameOptionKeyBindingType : uint8_t
{
	ETslGameOptionKeyBindingType__None = 0,
	ETslGameOptionKeyBindingType__Action = 1,
	ETslGameOptionKeyBindingType__Axis = 2,
	ETslGameOptionKeyBindingType__ETslGameOptionKeyBindingType_MAX = 3
};


// Enum TslGame.ETslGameOptionSupplementaryType
enum class ETslGameOptionSupplementaryType : uint8_t
{
	ETslGameOptionSupplementaryType__None = 0,
	ETslGameOptionSupplementaryType__KeyboardLayout = 1,
	ETslGameOptionSupplementaryType__PreviewImage = 2,
	ETslGameOptionSupplementaryType__PreviewCrosshair = 3,
	ETslGameOptionSupplementaryType__VolumeUnitMeter = 4,
	ETslGameOptionSupplementaryType__ETslGameOptionSupplementaryType_MAX = 5
};


// Enum TslGame.EOutGameMontageState
enum class EOutGameMontageState : uint8_t
{
	EOutGameMontageState__Default  = 0,
	EOutGameMontageState__Playing  = 1,
	EOutGameMontageState__Interrupted = 2,
	EOutGameMontageState__Finished = 3,
	EOutGameMontageState__EOutGameMontageState_MAX = 4
};


// Enum TslGame.EObserverHudAnimType
enum class EObserverHudAnimType : uint8_t
{
	EObserverHudAnimType__TeamWipeOutAnim = 0,
	EObserverHudAnimType__PersonalKillingSpreeAnim = 1,
	EObserverHudAnimType__TeamTotalKillingSpreeAnim = 2,
	EObserverHudAnimType__EObserverHudAnimType_MAX = 3
};


// Enum TslGame.ETslParticleCullType
enum class ETslParticleCullType : uint8_t
{
	ETslParticleCullType__None     = 0,
	ETslParticleCullType__Distance = 1,
	ETslParticleCullType__Frustum  = 2,
	ETslParticleCullType__LastRenderedTime = 3,
	ETslParticleCullType__SameTransform = 4,
	ETslParticleCullType__NearbyTransform = 5,
	ETslParticleCullType__DistAndFrustumAndNear = 6,
	ETslParticleCullType__All      = 7,
	ETslParticleCullType__ETslParticleCullType_MAX = 8
};


// Enum TslGame.ETslParticleGroupPriority
enum class ETslParticleGroupPriority : uint8_t
{
	ETslParticleGroupPriority__High = 0,
	ETslParticleGroupPriority__Low = 1,
	ETslParticleGroupPriority__ETslParticleGroupPriority_MAX = 2
};


// Enum TslGame.ECustomDamageZoneType
enum class ECustomDamageZoneType : uint8_t
{
	ECustomDamageZoneType__Head    = 0,
	ECustomDamageZoneType__UpperBody = 1,
	ECustomDamageZoneType__LowerBody = 2,
	ECustomDamageZoneType__Arms    = 3,
	ECustomDamageZoneType__Legs    = 4,
	ECustomDamageZoneType__ECustomDamageZoneType_MAX = 5
};


// Enum TslGame.ECustomDamageWeaponClass
enum class ECustomDamageWeaponClass : uint8_t
{
	ECustomDamageWeaponClass__Bullet = 0,
	ECustomDamageWeaponClass__Melee = 1,
	ECustomDamageWeaponClass__ECustomDamageWeaponClass_MAX = 2
};


// Enum TslGame.EThrowableState
enum class EThrowableState : uint8_t
{
	EThrowableState__Idle          = 0,
	EThrowableState__PinOff        = 1,
	EThrowableState__Cooking       = 2,
	EThrowableState__Throw         = 3,
	EThrowableState__Dropped       = 4,
	EThrowableState__EThrowableState_MAX = 5
};


// Enum TslGame.EProjectileExplosionStartType
enum class EProjectileExplosionStartType : uint8_t
{
	EProjectileExplosionStartType__NotStart = 0,
	EProjectileExplosionStartType__Impact = 1,
	EProjectileExplosionStartType__Delay = 2,
	EProjectileExplosionStartType__ImpactOrDelay = 3,
	EProjectileExplosionStartType__EProjectileExplosionStartType_MAX = 4
};


// Enum TslGame.EProjectileExplodeState
enum class EProjectileExplodeState : uint8_t
{
	EProjectileExplodeState__NotExplode = 0,
	EProjectileExplodeState__ImpactExplode = 1,
	EProjectileExplodeState__TimerExplode = 2,
	EProjectileExplodeState__EProjectileExplodeState_MAX = 3
};


// Enum TslGame.EProjectileExplosionRotationType
enum class EProjectileExplosionRotationType : uint8_t
{
	EProjectileExplosionRotationType__ProjectileUpVector = 0,
	EProjectileExplosionRotationType__WorldUpVector = 1,
	EProjectileExplosionRotationType__EProjectileExplosionRotationType_MAX = 2
};


// Enum TslGame.EMolotovSimulationType
enum class EMolotovSimulationType : uint8_t
{
	EMolotovSimulationType__Molotov_SimulationImpact = 0,
	EMolotovSimulationType__Molotov_SimulationProjectile = 1,
	EMolotovSimulationType__Molotov_SimulationFragment = 2,
	EMolotovSimulationType__Molotov_SimulationVolumetric = 3,
	EMolotovSimulationType__Molotov_MAX = 4
};


// Enum TslGame.ETslReferenceObjType
enum class ETslReferenceObjType : uint8_t
{
	ETslReferenceObjType__GameMode = 0,
	ETslReferenceObjType__Character = 1,
	ETslReferenceObjType__ETslReferenceObjType_MAX = 2
};


// Enum TslGame.EReplayTimelineMode
enum class EReplayTimelineMode : uint8_t
{
	EReplayTimelineMode__ReplayPlay = 0,
	EReplayTimelineMode__ReplayEditor = 1,
	EReplayTimelineMode__ReplayRender = 2,
	EReplayTimelineMode__EReplayTimelineMode_MAX = 3
};


// Enum TslGame.ETslWheelWidgetMouseCursorDirectionType
enum class ETslWheelWidgetMouseCursorDirectionType : uint8_t
{
	ETslWheelWidgetMouseCursorDirectionType__ABSOLUTE_COORD = 0,
	ETslWheelWidgetMouseCursorDirectionType__AREA_RESTRICTED_COORD = 1,
	ETslWheelWidgetMouseCursorDirectionType__CIRCULAR_RESTRICTED_COORD = 2,
	ETslWheelWidgetMouseCursorDirectionType__ETslWheelWidgetMouseCursorDirectionType_MAX = 3
};


// Enum TslGame.ETslWheelWidgetSelectType
enum class ETslWheelWidgetSelectType : uint8_t
{
	ETslWheelWidgetSelectType__BY_CLICK = 0,
	ETslWheelWidgetSelectType__BY_RELEASE = 1,
	ETslWheelWidgetSelectType__BY_MAX = 2
};


// Enum TslGame.EBluezoneState
enum class EBluezoneState : uint8_t
{
	EBluezoneState__None           = 0,
	EBluezoneState__Wait           = 1,
	EBluezoneState__Release        = 2,
	EBluezoneState__EBluezoneState_MAX = 3
};


// Enum TslGame.EEquipableItemIconVisibility
enum class EEquipableItemIconVisibility : uint8_t
{
	EEquipableItemIconVisibility__Always = 0,
	EEquipableItemIconVisibility__WhenEquipped = 1,
	EEquipableItemIconVisibility__EEquipableItemIconVisibility_MAX = 2
};


// Enum TslGame.EMinimapFocus
enum class EMinimapFocus : uint8_t
{
	EMinimapFocus__CharacterFocus  = 0,
	EMinimapFocus__NextPlayzoneFocus = 1,
	EMinimapFocus__None            = 2,
	EMinimapFocus__EMinimapFocus_MAX = 3
};


// Enum TslGame.EMarkStates
enum class EMarkStates : uint8_t
{
	EMarkStates__Normal            = 0,
	EMarkStates__Groggy            = 1,
	EMarkStates__Dead              = 2,
	EMarkStates__Vehicle           = 3,
	EMarkStates__Parachute         = 4,
	EMarkStates__Quitter           = 5,
	EMarkStates__EMarkStates_MAX   = 6
};


// Enum TslGame.EBinaryStepperType
enum class EBinaryStepperType : uint8_t
{
	EBinaryStepperType__OFF        = 0,
	EBinaryStepperType__ON         = 1,
	EBinaryStepperType__EBinaryStepperType_MAX = 2
};


// Enum TslGame.EGuideKeyType
enum class EGuideKeyType : uint8_t
{
	EGuideKeyType__None            = 0,
	EGuideKeyType__PickUp          = 1,
	EGuideKeyType__PickUpAndEquip  = 2,
	EGuideKeyType__PickUpAndPickUpAmount = 3,
	EGuideKeyType__Unequip         = 4,
	EGuideKeyType__DetachAll       = 5,
	EGuideKeyType__DetachAndDetachAll = 6,
	EGuideKeyType__Drop            = 7,
	EGuideKeyType__DropAndEquip    = 8,
	EGuideKeyType__DropAndDropAmount = 9,
	EGuideKeyType__DropAndDropAll  = 10,
	EGuideKeyType__Equip           = 11,
	EGuideKeyType__EquipAndQuickEquip = 12,
	EGuideKeyType__XQuickEquip     = 13,
	EGuideKeyType__XHoldQuickEquip = 14,
	EGuideKeyType__Swap            = 15,
	EGuideKeyType__Use             = 16,
	EGuideKeyType__Confirm         = 17,
	EGuideKeyType__Cancel          = 18,
	EGuideKeyType__SwitchSlot      = 19,
	EGuideKeyType__EGuideKeyType_MAX = 20
};


// Enum TslGame.EGuideLineType
enum class EGuideLineType : uint8_t
{
	EGuideLineType__Switch         = 0,
	EGuideLineType__Upper          = 1,
	EGuideLineType__Lower          = 2,
	EGuideLineType__EGuideLineType_MAX = 3
};


// Enum TslGame.EConditionOfDeath
enum class EConditionOfDeath : uint8_t
{
	EConditionOfDeath__HeatShot    = 0,
	EConditionOfDeath__DBNO        = 1,
	EConditionOfDeath__DBNOByHeadShot = 2,
	EConditionOfDeath__None        = 3,
	EConditionOfDeath__EConditionOfDeath_MAX = 4
};


// Enum TslGame.ENoReloadGuideType
enum class ENoReloadGuideType : uint8_t
{
	ENoReloadGuideType__Alwyas     = 0,
	ENoReloadGuideType__WhenCurrentWeapon = 1,
	ENoReloadGuideType__ENoReloadGuideType_MAX = 2
};


// Enum TslGame.ESurfaceEffect
enum class ESurfaceEffect : uint8_t
{
	ESurfaceEffect__S_None         = 0,
	ESurfaceEffect__S_Concrete_Roll = 1,
	ESurfaceEffect__S_Concrete_Skid = 2,
	ESurfaceEffect__S_Concrete_Spin = 3,
	ESurfaceEffect__S_Dirt_Roll    = 4,
	ESurfaceEffect__S_Dirt_Skid    = 5,
	ESurfaceEffect__S_Dirt_Spin    = 6,
	ESurfaceEffect__S_Water_Roll   = 7,
	ESurfaceEffect__S_Water_Skid   = 8,
	ESurfaceEffect__S_Water_Spin   = 9,
	ESurfaceEffect__S_Metal_Roll   = 10,
	ESurfaceEffect__S_Metal_Skid   = 11,
	ESurfaceEffect__S_Metal_Spin   = 12,
	ESurfaceEffect__S_Wood_Roll    = 13,
	ESurfaceEffect__S_Wood_Skid    = 14,
	ESurfaceEffect__S_Wood_Spin    = 15,
	ESurfaceEffect__S_Rock_Roll    = 16,
	ESurfaceEffect__S_Rock_Skid    = 17,
	ESurfaceEffect__S_Rock_Spin    = 18,
	ESurfaceEffect__S_Grass_Roll   = 19,
	ESurfaceEffect__S_Grass_Skid   = 20,
	ESurfaceEffect__S_Grass_Spin   = 21,
	ESurfaceEffect__S_Sand_Roll    = 22,
	ESurfaceEffect__S_Sand_Skid    = 23,
	ESurfaceEffect__S_Sand_Spin    = 24,
	ESurfaceEffect__S_Concrete_Brake = 25,
	ESurfaceEffect__S_Dirt_Brake   = 26,
	ESurfaceEffect__S_Water_Brake  = 27,
	ESurfaceEffect__S_Metal_Brake  = 28,
	ESurfaceEffect__S_Wood_Brake   = 29,
	ESurfaceEffect__S_Rock_Brake   = 30,
	ESurfaceEffect__S_Grass_Brake  = 31,
	ESurfaceEffect__S_Sand_Brake   = 32,
	ESurfaceEffect__S_Snow_Brake   = 33,
	ESurfaceEffect__S_SnowRock_Brake = 34,
	ESurfaceEffect__S_Ice_Brake    = 35,
	ESurfaceEffect__S_Common_BrakeDisc = 36,
	ESurfaceEffect__S_Concrete_Punctured_Roll = 37,
	ESurfaceEffect__S_Concrete_Punctured_Skid = 38,
	ESurfaceEffect__S_Concrete_Punctured_Spin = 39,
	ESurfaceEffect__S_Concrete_Punctured_Brake = 40,
	ESurfaceEffect__S_Snow_Roll    = 41,
	ESurfaceEffect__S_Snow_Skid    = 42,
	ESurfaceEffect__S_Snow_Spin    = 43,
	ESurfaceEffect__S_SnowRock_Roll = 44,
	ESurfaceEffect__S_SnowRock_Skid = 45,
	ESurfaceEffect__S_SnowRock_Spin = 46,
	ESurfaceEffect__S_Ice_Roll     = 47,
	ESurfaceEffect__S_Ice_Skid     = 48,
	ESurfaceEffect__S_Ice_Spin     = 49,
	ESurfaceEffect__S_MAX          = 50
};


// Enum TslGame.EHitCheckType
enum class EHitCheckType : uint8_t
{
	EHitCheckType__HitCheck_Once   = 0,
	EHitCheckType__HitCheck_Multi  = 1,
	EHitCheckType__HitCheck_MAX    = 2
};


// Enum TslGame.EFlashbangDebuffCurveValueTypes
enum class EFlashbangDebuffCurveValueTypes : uint8_t
{
	EFlashbangDebuffCurveValueTypes__Blindness_Duration_Direct = 0,
	EFlashbangDebuffCurveValueTypes__Blindness_Duration_Indirect = 1,
	EFlashbangDebuffCurveValueTypes__Tinnitus_Level = 2,
	EFlashbangDebuffCurveValueTypes__EFlashbangDebuffCurveValueTypes_MAX = 3
};


// Enum TslGame.EBluezoneType
enum class EBluezoneType : uint8_t
{
	EBluezoneType__Normal          = 0,
	EBluezoneType__Fast            = 1,
	EBluezoneType__EBluezoneType_MAX = 2
};


// Enum TslGame.EPlayerAuthState
enum class EPlayerAuthState : uint8_t
{
	EPlayerAuthState__None         = 0,
	EPlayerAuthState__Login        = 1,
	EPlayerAuthState__Logout       = 2,
	EPlayerAuthState__EPlayerAuthState_MAX = 3
};


// Enum TslGame.EInteractionPhase
enum class EInteractionPhase : uint8_t
{
	EInteractionPhase__First       = 0,
	EInteractionPhase__Second      = 1,
	EInteractionPhase__EInteractionPhase_MAX = 2
};


// Enum TslGame.ELobbyItemBundleType
enum class ELobbyItemBundleType : uint8_t
{
	ELobbyItemBundleType__Bundle   = 0,
	ELobbyItemBundleType__Generator = 1,
	ELobbyItemBundleType__ELobbyItemBundleType_MAX = 2
};


// Enum TslGame.EItemSpawnType
enum class EItemSpawnType : uint8_t
{
	EItemSpawnType__FixedRatioAndAdjustableTotalNumber = 0,
	EItemSpawnType__AdjustableRatioAndFixedTotalNumber = 1,
	EItemSpawnType__AdjustableRatioAndAdjustableTotalNumber = 2,
	EItemSpawnType__EItemSpawnType_MAX = 3
};


// Enum TslGame.ELocationType
enum class ELocationType : uint8_t
{
	ELocationType__LANDMARK        = 0,
	ELocationType__EXTRA_LANDMARK  = 1,
	ELocationType__CITY            = 2,
	ELocationType__CITY_DETAIL     = 3,
	ELocationType__TOWN            = 4,
	ELocationType__COMPOUNDS       = 5,
	ELocationType__EXTRA           = 6,
	ELocationType__TEST_SHOW_ALL   = 7,
	ELocationType__ELocationType_MAX = 8
};


// Enum TslGame.EClimate
enum class EClimate : uint8_t
{
	Climate_Normal                 = 0,
	Climate_Hot                    = 1,
	Climate_Cold                   = 2,
	Climate_Warm                   = 3,
	Climate_Humid                  = 4,
	Climate_HotAndHumid            = 5,
	Climate_ColdAndHumid           = 6,
	Climate_WarmAndHumid           = 7,
	Climate_Dry                    = 8,
	Climate_HotAndDry              = 9,
	Climate_ColdAndDry             = 10,
	Climate_WarmAndDry             = 11,
	Climate_MAX                    = 12
};


// Enum TslGame.ELobbyLinkState
enum class ELobbyLinkState : uint8_t
{
	ELobbyLinkState__Disconnect    = 0,
	ELobbyLinkState__WaitInitialize = 1,
	ELobbyLinkState__WaitStart     = 2,
	ELobbyLinkState__Gaming        = 3,
	ELobbyLinkState__Finished      = 4,
	ELobbyLinkState__ELobbyLinkState_MAX = 5
};


// Enum TslGame.ELobbyCharacterAnimationType
enum class ELobbyCharacterAnimationType : uint8_t
{
	ELobbyCharacterAnimationType__Default = 0,
	ELobbyCharacterAnimationType__Wardrobe = 1,
	ELobbyCharacterAnimationType__Appearance = 2,
	ELobbyCharacterAnimationType__ELobbyCharacterAnimationType_MAX = 3
};


// Enum TslGame.EParameterLUTChannel
enum class EParameterLUTChannel : uint8_t
{
	EParameterLUTChannel__R        = 0,
	EParameterLUTChannel__G        = 1,
	EParameterLUTChannel__B        = 2,
	EParameterLUTChannel__A        = 3,
	EParameterLUTChannel__RGBA     = 4,
	EParameterLUTChannel__Undefined = 5,
	EParameterLUTChannel__EParameterLUTChannel_MAX = 6
};


// Enum TslGame.EMaterialParameterType
enum class EMaterialParameterType : uint8_t
{
	EMaterialParameterType__Bool   = 0,
	EMaterialParameterType__Scalar = 1,
	EMaterialParameterType__Vector = 2,
	EMaterialParameterType__Texture = 3,
	EMaterialParameterType__Undefined = 4,
	EMaterialParameterType__EMaterialParameterType_MAX = 5
};


// Enum TslGame.ERandomPointSelect
enum class ERandomPointSelect : uint8_t
{
	ERandomPointSelect__NavPoint   = 0,
	ERandomPointSelect__NavPointInRadius = 1,
	ERandomPointSelect__ReachableNavPointInRadius = 2,
	ERandomPointSelect__ERandomPointSelect_MAX = 3
};


// Enum TslGame.ENpcDirection
enum class ENpcDirection : uint8_t
{
	ENpcDirection__Forward         = 0,
	ENpcDirection__Backward        = 1,
	ENpcDirection__Left            = 2,
	ENpcDirection__Right           = 3,
	ENpcDirection__ForwardRight    = 4,
	ENpcDirection__BackwardRight   = 5,
	ENpcDirection__BackwardLeft    = 6,
	ENpcDirection__ForwardLeft     = 7,
	ENpcDirection__ENpcDirection_MAX = 8
};


// Enum TslGame.ENpcWalkingSpeedType
enum class ENpcWalkingSpeedType : uint8_t
{
	ENpcWalkingSpeedType__Idle     = 0,
	ENpcWalkingSpeedType__Walk     = 1,
	ENpcWalkingSpeedType__Run      = 2,
	ENpcWalkingSpeedType__Sprint   = 3,
	ENpcWalkingSpeedType__ENpcWalkingSpeedType_MAX = 4
};


// Enum TslGame.ENpcCharacterStateType
enum class ENpcCharacterStateType : uint8_t
{
	ENpcCharacterStateType__Default = 0,
	ENpcCharacterStateType__Respawn = 1,
	ENpcCharacterStateType__Fire1  = 2,
	ENpcCharacterStateType__Fire2  = 3,
	ENpcCharacterStateType__Fire3  = 4,
	ENpcCharacterStateType__Knockback = 5,
	ENpcCharacterStateType__Knockdown = 6,
	ENpcCharacterStateType__Getup  = 7,
	ENpcCharacterStateType__ENpcCharacterStateType_MAX = 8
};


// Enum TslGame.ERandomType
enum class ERandomType : uint8_t
{
	ERandomType__Random            = 0,
	ERandomType__Shuffle           = 1,
	ERandomType__Ascending         = 2,
	ERandomType__Descending        = 3,
	ERandomType__ERandomType_MAX   = 4
};


// Enum TslGame.ECustomAnimDataType
enum class ECustomAnimDataType : uint8_t
{
	ECustomAnimDataType__CustomAnimData = 0,
	ECustomAnimDataType__AnimSequence = 1,
	ECustomAnimDataType__ECustomAnimDataType_MAX = 2
};


// Enum TslGame.ECustomAnimSlotType
enum class ECustomAnimSlotType : uint8_t
{
	ECustomAnimSlotType__FullBody  = 0,
	ECustomAnimSlotType__UpperBody = 1,
	ECustomAnimSlotType__FullBodyInstance = 2,
	ECustomAnimSlotType__UpperBodyInstance = 3,
	ECustomAnimSlotType__LowerBody = 4,
	ECustomAnimSlotType__ECustomAnimSlotType_MAX = 5
};


// Enum TslGame.ERetriggerCounter
enum class ERetriggerCounter : uint8_t
{
	ERetriggerCounter__First       = 0,
	ERetriggerCounter__Sec         = 1,
	ERetriggerCounter__Third       = 2,
	ERetriggerCounter__Fourth      = 3,
	ERetriggerCounter__ERetriggerCounter_MAX = 4
};


// Enum TslGame.EPathDebugType
enum class EPathDebugType : uint8_t
{
	EPathDebugType__None           = 0,
	EPathDebugType__Location       = 1,
	EPathDebugType__SelectNpc      = 2,
	EPathDebugType__EPathDebugType_MAX = 3
};


// Enum TslGame.EHornSoundType
enum class EHornSoundType : uint8_t
{
	EHornSoundType__HornOn         = 0,
	EHornSoundType__HornOff        = 1,
	EHornSoundType__InstantHorn    = 2,
	EHornSoundType__EHornSoundType_MAX = 3
};


// Enum TslGame.EVehicleAnimType
enum class EVehicleAnimType : uint8_t
{
	EVehicleAnimType__DefaultDriver = 0,
	EVehicleAnimType__DefaultPassenger = 1,
	EVehicleAnimType__BuggyDriver  = 2,
	EVehicleAnimType__BuggyPassenger = 3,
	EVehicleAnimType__DaciaDriver  = 4,
	EVehicleAnimType__DaciaPassengerFR = 5,
	EVehicleAnimType__DaciaPassengerBL = 6,
	EVehicleAnimType__DaciaPassengerBC = 7,
	EVehicleAnimType__DaciaPassengerBR = 8,
	EVehicleAnimType__UazDriver    = 9,
	EVehicleAnimType__UazPassengerFR = 10,
	EVehicleAnimType__UazPassengerBL = 11,
	EVehicleAnimType__UazPassengerBC = 12,
	EVehicleAnimType__UazPassengerBR = 13,
	EVehicleAnimType__BoatDriver   = 14,
	EVehicleAnimType__BoatPassengerFR = 15,
	EVehicleAnimType__BoatPassengerBL = 16,
	EVehicleAnimType__BoatPassengerBC = 17,
	EVehicleAnimType__BoatPassengerBR = 18,
	EVehicleAnimType__MotoDriver   = 19,
	EVehicleAnimType__MotoPassenger = 20,
	EVehicleAnimType__MotoSidecar  = 21,
	EVehicleAnimType__MotoDriverSidecar = 22,
	EVehicleAnimType__MotoPassengerSidecar = 23,
	EVehicleAnimType__AircraftPassenger = 24,
	EVehicleAnimType__JetskiDriver = 25,
	EVehicleAnimType__JetskiPassenger = 26,
	EVehicleAnimType__PickupTruckDriver = 27,
	EVehicleAnimType__PickupTruckPassengerFR = 28,
	EVehicleAnimType__PickupTruckPassengerBL_Open = 29,
	EVehicleAnimType__PickupTruckPassengerBR_Open = 30,
	EVehicleAnimType__PickupTruckPassengerBL_Closed = 31,
	EVehicleAnimType__PickupTruckPassengerBR_Closed = 32,
	EVehicleAnimType__MinibusDriver = 33,
	EVehicleAnimType__MinibusPassengerFR = 34,
	EVehicleAnimType__MinibusPassengerML = 35,
	EVehicleAnimType__MinibusPassengerMR = 36,
	EVehicleAnimType__MinibusPassengerBL = 37,
	EVehicleAnimType__MinibusPassengerBR = 38,
	EVehicleAnimType__MiradoDriver = 39,
	EVehicleAnimType__MiradoFR     = 40,
	EVehicleAnimType__MiradoRL     = 41,
	EVehicleAnimType__MiradoRR     = 42,
	EVehicleAnimType__ScooterPassenger = 43,
	EVehicleAnimType__TukDriver    = 44,
	EVehicleAnimType__RonyDriver   = 45,
	EVehicleAnimType__Snowmobile_Passenger = 46,
	EVehicleAnimType__YetiDriver   = 47,
	EVehicleAnimType__YetiPassenger = 48,
	EVehicleAnimType__LadaNivaDriver = 49,
	EVehicleAnimType__EVehicleAnimType_MAX = 50
};


// Enum TslGame.ERiderType
enum class ERiderType : uint8_t
{
	ERiderType__Driver             = 0,
	ERiderType__Passenger          = 1,
	ERiderType__ERiderType_MAX     = 2
};


// Enum TslGame.EDoorState
enum class EDoorState : uint8_t
{
	EDoorState__Closed             = 0,
	EDoorState__Closing            = 1,
	EDoorState__Opened             = 2,
	EDoorState__Opening            = 3,
	EDoorState__EDoorState_MAX     = 4
};


// Enum TslGame.EThingGroupSpawnType
enum class EThingGroupSpawnType : uint8_t
{
	EThingGroupSpawnType__None     = 0,
	EThingGroupSpawnType__Probability = 1,
	EThingGroupSpawnType__TotalCount = 2,
	EThingGroupSpawnType__EThingGroupSpawnType_MAX = 3
};


// Enum TslGame.EWheelContactType
enum class EWheelContactType : uint8_t
{
	WCT_Static                     = 0,
	WCT_Roll                       = 1,
	WCT_LatSlip                    = 2,
	WCT_LongSlip                   = 3,
	WCT_MAX                        = 4
};


// Enum TslGame.EAnimShieldState
enum class EAnimShieldState : uint8_t
{
	EAnimShieldState__SS_Hip       = 0,
	EAnimShieldState__SS_Block     = 1,
	EAnimShieldState__SS_ADS       = 2,
	EAnimShieldState__SS_MAX       = 3
};


// Enum TslGame.EAnimPawnState
enum class EAnimPawnState : uint8_t
{
	EAnimPawnState__PS_OnFoot      = 0,
	EAnimPawnState__PS_VehicleDriver = 1,
	EAnimPawnState__PS_VehiclePassenger = 2,
	EAnimPawnState__PS_Freefall    = 3,
	EAnimPawnState__PS_Parachute   = 4,
	EAnimPawnState__PS_Swim        = 5,
	EAnimPawnState__PS_DBNO        = 6,
	EAnimPawnState__PS_Reviving    = 7,
	EAnimPawnState__PS_Flying      = 8,
	EAnimPawnState__PS_ActiveRagdoll = 9,
	EAnimPawnState__PS_MAX         = 10
};


// Enum TslGame.EDamageVictimActorType
enum class EDamageVictimActorType : uint8_t
{
	EDamageVictimActorType__Character = 0,
	EDamageVictimActorType__Vehicle = 1,
	EDamageVictimActorType__Wheel  = 2,
	EDamageVictimActorType__DestructibleActor = 3,
	EDamageVictimActorType__EDamageVictimActorType_MAX = 4
};


// Enum TslGame.EHoldButtonWidgetType
enum class EHoldButtonWidgetType : uint8_t
{
	EHoldButtonWidgetType__EHoldButtonWidgetType_X = 0,
	EHoldButtonWidgetType__EHoldButtonWidgetType_Y = 1,
	EHoldButtonWidgetType__EHoldButtonWidgetType_A = 2,
	EHoldButtonWidgetType__EHoldButtonWidgetType_B = 3,
	EHoldButtonWidgetType__EHoldButtonWidgetType_MAX = 4
};


// Enum TslGame.EDamageFieldType
enum class EDamageFieldType : uint8_t
{
	EDamageFieldType__Default      = 0,
	EDamageFieldType__DirectTick   = 1,
	EDamageFieldType__EDamageFieldType_MAX = 2
};


// Enum TslGame.EEffectSpreadState
enum class EEffectSpreadState : uint8_t
{
	EEffectSpreadState__ESS_InitialTrace = 0,
	EEffectSpreadState__ESS_InitialProcess = 1,
	EEffectSpreadState__ESS_Spreading = 2,
	EEffectSpreadState__ESS_SpreadDone = 3,
	EEffectSpreadState__ESS_Ending = 4,
	EEffectSpreadState__ESS_MAX    = 5
};


// Enum TslGame.ETslFenceSelector
enum class ETslFenceSelector : uint8_t
{
	ETslFenceSelector__None        = 0,
	ETslFenceSelector__Use         = 1,
	ETslFenceSelector__Use01       = 2,
	ETslFenceSelector__Use02       = 3,
	ETslFenceSelector__Use03       = 4,
	ETslFenceSelector__ETslFenceSelector_MAX = 5
};


// Enum TslGame.EReactionType
enum class EReactionType : uint8_t
{
	EReactionType__Reaciton_None   = 0,
	EReactionType__Reaction_Physics = 1,
	EReactionType__Reaction_Destructible = 2,
	EReactionType__EReactionType_MAX = 3
};


// Enum TslGame.EWarModeCarePackageKitType
enum class EWarModeCarePackageKitType : uint8_t
{
	EWarModeCarePackageKitType__CarepackageKit_Off = 0,
	EWarModeCarePackageKitType__CarepackageKit_Basic = 1,
	EWarModeCarePackageKitType__CarepackageKit_ARKit = 2,
	EWarModeCarePackageKitType__CarepackageKit_SRKit = 3,
	EWarModeCarePackageKitType__CarepackageKit_MAX = 4
};


// Enum TslGame.EPopupStyle
enum class EPopupStyle : uint8_t
{
	EPopupStyle__Ok_Cancel         = 0,
	EPopupStyle__Ok                = 1,
	EPopupStyle__Yes_No            = 2,
	EPopupStyle__EPopupStyle_MAX   = 3
};


// Enum TslGame.EEquippedWeaponRTPC
enum class EEquippedWeaponRTPC : uint8_t
{
	EEquippedWeaponRTPC__None      = 0,
	EEquippedWeaponRTPC__HandBomb_Bottle = 1,
	EEquippedWeaponRTPC__HandBomb_Metal = 2,
	EEquippedWeaponRTPC__Melee     = 3,
	EEquippedWeaponRTPC__Pistol    = 4,
	EEquippedWeaponRTPC__SMG       = 5,
	EEquippedWeaponRTPC__AR        = 6,
	EEquippedWeaponRTPC__SR        = 7,
	EEquippedWeaponRTPC__Max       = 8,
	EEquippedWeaponRTPC__EEquippedWeaponRTPC_MAX = 9
};


// Enum TslGame.EForceRefreshDummy
enum class EForceRefreshDummy : uint8_t
{
	EForceRefreshDummy__Refresh1   = 0,
	EForceRefreshDummy__Refresh2   = 1,
	EForceRefreshDummy__EForceRefreshDummy_MAX = 2
};


// Enum TslGame.EViewModeCategory
enum class EViewModeCategory : uint8_t
{
	EViewModeCategory__None        = 0,
	EViewModeCategory__Weapon      = 1,
	EViewModeCategory__Parachute   = 2,
	EViewModeCategory__Character   = 3,
	EViewModeCategory__EViewModeCategory_MAX = 4
};


// Enum TslGame.ERankGuideType
enum class ERankGuideType : uint8_t
{
	ERankGuideType__ForElementaryRank = 0,
	ERankGuideType__ForExpertRank  = 1,
	ERankGuideType__ERankGuideType_MAX = 2
};


// Enum TslGame.EUserRank
enum class EUserRank : uint8_t
{
	EUserRank__ElementaryRank      = 0,
	EUserRank__IntermediateRank    = 1,
	EUserRank__HighRank            = 2,
	EUserRank__ExpertRank          = 3,
	EUserRank__EUserRank_MAX       = 4
};


// Enum TslGame.EProjectileParticleClass
enum class EProjectileParticleClass : uint8_t
{
	EProjectileParticleClass__PPC_None = 0,
	EProjectileParticleClass__PPC_Frag = 1,
	EProjectileParticleClass__PPC_Flash = 2,
	EProjectileParticleClass__PPC_Smoke = 3,
	EProjectileParticleClass__PPC_Molotov = 4,
	EProjectileParticleClass__PPC_Other = 5,
	EProjectileParticleClass__PPC_MAX = 6
};


// Enum TslGame.EReticleType
enum class EReticleType : uint8_t
{
	EReticleType__RedDot           = 0,
	EReticleType__HoloSight        = 1,
	EReticleType__Scope2x          = 2,
	EReticleType__Scope3x          = 3,
	EReticleType__Scope4x          = 4,
	EReticleType__Scope6x          = 5,
	EReticleType__Scope8x          = 6,
	EReticleType__EReticleType_MAX = 7
};


// Enum TslGame.EKeyHintType
enum class EKeyHintType : uint8_t
{
	EKeyHintType__Menu             = 0,
	EKeyHintType__Parachuting      = 1,
	EKeyHintType__Character        = 2,
	EKeyHintType__Driver           = 3,
	EKeyHintType__Rider            = 4,
	EKeyHintType__WeaponUse        = 5,
	EKeyHintType__WeaponChange     = 6,
	EKeyHintType__ADS              = 7,
	EKeyHintType__Aim              = 8,
	EKeyHintType__ADS_8x15x        = 9,
	EKeyHintType__ADS_6x           = 10,
	EKeyHintType__ADS_1x2x3x       = 11,
	EKeyHintType__ADS_IronSight    = 12,
	EKeyHintType__Throwing         = 13,
	EKeyHintType__Heal             = 14,
	EKeyHintType__Swimming         = 15,
	EKeyHintType__TeamSpectating   = 16,
	EKeyHintType__KillerSpectating = 17,
	EKeyHintType__WorldMap         = 18,
	EKeyHintType__None             = 19,
	EKeyHintType__FreefallNew      = 20,
	EKeyHintType__ParachuteNew     = 21,
	EKeyHintType__EKeyHintType_MAX = 22
};


// Enum TslGame.EObserverOutlineType
enum class EObserverOutlineType : uint8_t
{
	SpectatedCharacter             = 0,
	SpectatedCharacterTeam         = 1,
	SpectatedCharacterEnemy        = 2,
	WithoutSpectatedCharacter      = 3,
	WithoutSpectatedTeamCharacter  = 4,
	InteractionFocusingColor       = 5,
	EObserverOutlineType_MAX       = 6
};


// Enum TslGame.EOptionExposeType
enum class EOptionExposeType : uint8_t
{
	EOptionExposeType__All         = 0,
	EOptionExposeType__PcOnly      = 1,
	EOptionExposeType__XBoxOnly    = 2,
	EOptionExposeType__PS4Only     = 3,
	EOptionExposeType__PcAndXBox   = 4,
	EOptionExposeType__PcAndPS4    = 5,
	EOptionExposeType__XBoxAndPS4  = 6,
	EOptionExposeType__None        = 7,
	EOptionExposeType__EOptionExposeType_MAX = 8
};


// Enum TslGame.EWeatherChange
enum class EWeatherChange : uint8_t
{
	EWeatherChange__NoChange       = 0,
	EWeatherChange__Rainy          = 1,
	EWeatherChange__Foggy          = 2,
	EWeatherChange__EWeatherChange_MAX = 3
};


// Enum TslGame.EMinimapColorType
enum class EMinimapColorType : uint8_t
{
	EMinimapColorType__DESATURATED = 0,
	EMinimapColorType__SATURATED   = 1,
	EMinimapColorType__EMinimapColorType_MAX = 2
};


// Enum TslGame.EDamageZoneType
enum class EDamageZoneType : uint8_t
{
	EDamageZoneType__Head          = 0,
	EDamageZoneType__Torso         = 1,
	EDamageZoneType__Arm           = 2,
	EDamageZoneType__Pelvis        = 3,
	EDamageZoneType__Leg           = 4,
	EDamageZoneType__EDamageZoneType_MAX = 5
};


// Enum TslGame.ERedZoneGenerateType
enum class ERedZoneGenerateType : uint8_t
{
	ERedZoneGenerateType__None     = 0,
	ERedZoneGenerateType__Uniform_Distribution = 1,
	ERedZoneGenerateType__Ringtaw  = 2,
	ERedZoneGenerateType__Outsider = 3,
	ERedZoneGenerateType__RingtawOrOutsider = 4,
	ERedZoneGenerateType__ERedZoneGenerateType_MAX = 5
};


// Enum TslGame.ETslHudType
enum class ETslHudType : uint8_t
{
	ETslHudType__None              = 0,
	ETslHudType__CharacterHud      = 1,
	ETslHudType__SpectatorHud      = 2,
	ETslHudType__ObserverHud       = 3,
	ETslHudType__ReplayHud         = 4,
	ETslHudType__ETslHudType_MAX   = 5
};


// Enum TslGame.EAnimatableCustomizableTypes
enum class EAnimatableCustomizableTypes : uint8_t
{
	EAnimatableCustomizableTypes__Hair = 0,
	EAnimatableCustomizableTypes__Outer = 1,
	EAnimatableCustomizableTypes__Legs = 2,
	EAnimatableCustomizableTypes__EAnimatableCustomizableTypes_MAX = 3
};


// Enum TslGame.EGameEndState
enum class EGameEndState : uint8_t
{
	EGameEndState__None            = 0,
	EGameEndState__CereMony        = 1,
	EGameEndState__Cinematic       = 2,
	EGameEndState__MatchFinish     = 3,
	EGameEndState__EGameEndState_MAX = 4
};


// Enum TslGame.ELobbyBlurChangingStates
enum class ELobbyBlurChangingStates : uint8_t
{
	ELobbyBlurChangingStates__AlwaysOff = 0,
	ELobbyBlurChangingStates__AlwaysOn = 1,
	ELobbyBlurChangingStates__ELobbyBlurChangingStates_MAX = 2
};


// Enum TslGame.ELobbyCameraStates
enum class ELobbyCameraStates : uint8_t
{
	ELobbyCameraStates__XBox_Home  = 0,
	ELobbyCameraStates__Main       = 1,
	ELobbyCameraStates__Main01     = 2,
	ELobbyCameraStates__Menu       = 3,
	ELobbyCameraStates__Custom     = 4,
	ELobbyCameraStates__Custom01   = 5,
	ELobbyCameraStates__EventPass_Milestone = 6,
	ELobbyCameraStates__EventPass_Milestone01 = 7,
	ELobbyCameraStates__EventPass_Missions = 8,
	ELobbyCameraStates__ViewMode_Character = 9,
	ELobbyCameraStates__ViewMode_Weapon = 10,
	ELobbyCameraStates__ViewMode_Parachute = 11,
	ELobbyCameraStates__EventPass_Milestone_0_Particle = 12,
	ELobbyCameraStates__None       = 13,
	ELobbyCameraStates__ELobbyCameraStates_MAX = 14
};


// Enum TslGame.EUiShowType
enum class EUiShowType : uint8_t
{
	EUiShowType__AlwaysShow        = 0,
	EUiShowType__TpsOnlyShow       = 1,
	EUiShowType__FpsOnlyShow       = 2,
	EUiShowType__AlwaysHide        = 3,
	EUiShowType__EUiShowType_MAX   = 4
};


// Enum TslGame.EParachuteCutoffState
enum class EParachuteCutoffState : uint8_t
{
	EParachuteCutoffState__Cutoff_None = 0,
	EParachuteCutoffState__Cutoff_Manual = 1,
	EParachuteCutoffState__Cutoff_Automatic = 2,
	EParachuteCutoffState__Cutoff_Ready = 3,
	EParachuteCutoffState__Cutoff_MAX = 4
};


// Enum TslGame.ESkydiveState
enum class ESkydiveState : uint8_t
{
	ESkydiveState__Skydive_None    = 0,
	ESkydiveState__Skydive_Freefall = 1,
	ESkydiveState__Skydive_ParachuteDeploying = 2,
	ESkydiveState__Skydive_ParachuteDeployed = 3,
	ESkydiveState__Skydive_ParachuteCollapsing = 4,
	ESkydiveState__Skydive_MAX     = 5
};


// Enum TslGame.EGamepadInputResponseTypes
enum class EGamepadInputResponseTypes : uint8_t
{
	EGamepadInputResponseTypes__Pressed = 0,
	EGamepadInputResponseTypes__Released = 1,
	EGamepadInputResponseTypes__Tap = 2,
	EGamepadInputResponseTypes__Hold = 3,
	EGamepadInputResponseTypes__DoubleTap = 4,
	EGamepadInputResponseTypes__EGamepadInputResponseTypes_MAX = 5
};


// Enum TslGame.EGamepadPresets
enum class EGamepadPresets : uint8_t
{
	EGamepadPresets__Preset        = 0,
	EGamepadPresets__Preset01      = 1,
	EGamepadPresets__Preset_MAX    = 2
};


// Enum TslGame.EKeyGuideShowCases
enum class EKeyGuideShowCases : uint8_t
{
	EKeyGuideShowCases__Reload     = 0,
	EKeyGuideShowCases__ExitVehicle = 1,
	EKeyGuideShowCases__EKeyGuideShowCases_MAX = 2
};


// Enum TslGame.ETslInputModes
enum class ETslInputModes : uint8_t
{
	ETslInputModes__Toggle         = 0,
	ETslInputModes__Hold           = 1,
	ETslInputModes__DoubleTap      = 2,
	ETslInputModes__ETslInputModes_MAX = 3
};


// Enum TslGame.EGameplayClientReplay
enum class EGameplayClientReplay : uint8_t
{
	EGameplayClientReplay__Replay  = 0,
	EGameplayClientReplay__Killcam = 1,
	EGameplayClientReplay__EGameplayClientReplay_MAX = 2
};


// Enum TslGame.EGameplayFunctionalities
enum class EGameplayFunctionalities : uint8_t
{
	EGameplayFunctionalities__FreeLookInterp = 0,
	EGameplayFunctionalities__EGameplayFunctionalities_MAX = 1
};


// Enum TslGame.EInputModeSettingActions
enum class EInputModeSettingActions : uint8_t
{
	EInputModeSettingActions__Crouch = 0,
	EInputModeSettingActions__Prone = 1,
	EInputModeSettingActions__Walk = 2,
	EInputModeSettingActions__Sprint = 3,
	EInputModeSettingActions__HoldRotation = 4,
	EInputModeSettingActions__HoldBreath = 5,
	EInputModeSettingActions__Peek = 6,
	EInputModeSettingActions__Map  = 7,
	EInputModeSettingActions__ADS  = 8,
	EInputModeSettingActions__Aim  = 9,
	EInputModeSettingActions__HoldAngled = 10,
	EInputModeSettingActions__EInputModeSettingActions_MAX = 11
};


// Enum TslGame.EKeyBindingSlot
enum class EKeyBindingSlot : uint8_t
{
	EKeyBindingSlot__FirstKey      = 0,
	EKeyBindingSlot__SecondKey     = 1,
	EKeyBindingSlot__EKeyBindingSlot_MAX = 2
};


// Enum TslGame.EReportDetailCauseType
enum class EReportDetailCauseType : uint8_t
{
	EReportDetailCauseType__AutoAim = 0,
	EReportDetailCauseType__NoRecoil = 1,
	EReportDetailCauseType__EspOrPenetration = 2,
	EReportDetailCauseType__Speedhack = 3,
	EReportDetailCauseType__EReportDetailCauseType_MAX = 4
};


// Enum TslGame.EReportedSessionType
enum class EReportedSessionType : uint8_t
{
	EReportedSessionType__PublicOrCustomGame = 0,
	EReportedSessionType__Killcam  = 1,
	EReportedSessionType__Replay   = 2,
	EReportedSessionType__EReportedSessionType_MAX = 3
};


// Enum TslGame.EReportCause
enum class EReportCause : uint8_t
{
	EReportCause__Default          = 0,
	EReportCause__Cheat            = 1,
	EReportCause__TeamKill         = 2,
	EReportCause__Teaming          = 3,
	EReportCause__InappropriateID  = 4,
	EReportCause__VerbalHarassment = 5,
	EReportCause__Griefing         = 6,
	EReportCause__EReportCause_MAX = 7
};


// Enum TslGame.ItemPackageType
enum class EItemPackageType : uint8_t
{
	ItemPackageType__RootBox       = 0,
	ItemPackageType__CarePackage   = 1,
	ItemPackageType__DroppedPackage = 2,
	ItemPackageType__ItemPackageType_MAX = 3
};


// Enum TslGame.ECarePackageIconType
enum class ECarePackageIconType : uint8_t
{
	ECarePackageIconType__Normal   = 0,
	ECarePackageIconType__Flying   = 1,
	ECarePackageIconType__Opened   = 2,
	ECarePackageIconType__ECarePackageIconType_MAX = 3
};


// Enum TslGame.ECharacterIconType
enum class ECharacterIconType : uint8_t
{
	ECharacterIconType__Normal     = 0,
	ECharacterIconType__Vehicle    = 1,
	ECharacterIconType__Parachute  = 2,
	ECharacterIconType__Die        = 3,
	ECharacterIconType__Groggy     = 4,
	ECharacterIconType__Quitter    = 5,
	ECharacterIconType__Observer   = 6,
	ECharacterIconType__ECharacterIconType_MAX = 7
};


// Enum TslGame.EReportUiType
enum class EReportUiType : uint8_t
{
	EReportUiType__Normal          = 0,
	EReportUiType__Respawn         = 1,
	EReportUiType__EReportUiType_MAX = 2
};


// Enum TslGame.EZombieModePlayerState
enum class EZombieModePlayerState : uint8_t
{
	EZombieModePlayerState__None   = 0,
	EZombieModePlayerState__Human  = 1,
	EZombieModePlayerState__ReadyToRevive = 2,
	EZombieModePlayerState__Zombie = 3,
	EZombieModePlayerState__EZombieModePlayerState_MAX = 4
};


// Enum TslGame.ETeamChangeZombieMode
enum class ETeamChangeZombieMode : uint8_t
{
	ETeamChangeZombieMode__None    = 0,
	ETeamChangeZombieMode__LeaveTeam = 1,
	ETeamChangeZombieMode__JoinTeam = 2,
	ETeamChangeZombieMode__ETeamChangeZombieMode_MAX = 3
};


// Enum TslGame.EFollowCameraMode
enum class EFollowCameraMode : uint8_t
{
	EFollowCameraMode__CharacterCamera = 0,
	EFollowCameraMode__VehicleCamera = 1,
	EFollowCameraMode__AircraftCamera = 2,
	EFollowCameraMode__ParachutingCamera = 3,
	EFollowCameraMode__FallingWithParachuteCamera = 4,
	EFollowCameraMode__EFollowCameraMode_MAX = 5
};


// Enum TslGame.EObserverCameraMode
enum class EObserverCameraMode : uint8_t
{
	EObserverCameraMode__FixedCamera = 0,
	EObserverCameraMode__FreeCamera = 1,
	EObserverCameraMode__PlayerCamera = 2,
	EObserverCameraMode__FollowCamera = 3,
	EObserverCameraMode__EObserverCameraMode_MAX = 4
};


// Enum TslGame.EObserverAuthorityType
enum class EObserverAuthorityType : uint8_t
{
	EObserverAuthorityType__None   = 0,
	EObserverAuthorityType__FromBeginning = 1,
	EObserverAuthorityType__AfterDeath = 2,
	EObserverAuthorityType__AfterExtermination = 3,
	EObserverAuthorityType__EagleEye = 4,
	EObserverAuthorityType__EObserverAuthorityType_MAX = 5
};


// Enum TslGame.EGameModeType
enum class EGameModeType : uint8_t
{
	EGameModeType__BattleRoyale    = 0,
	EGameModeType__War             = 1,
	EGameModeType__Zombie          = 2,
	EGameModeType__Conquest        = 3,
	EGameModeType__Training        = 4,
	EGameModeType__None            = 5,
	EGameModeType__EGameModeType_MAX = 6
};


// Enum TslGame.EValueType
enum class EValueType : uint8_t
{
	EValueType__Float              = 0,
	EValueType__Int                = 1,
	EValueType__String             = 2,
	EValueType__Bool               = 3,
	EValueType__EValueType_MAX     = 4
};


// Enum TslGame.EQualityType
enum class EQualityType : uint8_t
{
	EQualityType__EMainQuality     = 0,
	EQualityType__EViewDistanceQuality = 1,
	EQualityType__EShadowQuality   = 2,
	EQualityType__EAntiAliasingQuality = 3,
	EQualityType__ETextureQuality  = 4,
	EQualityType__EVisualEffectQuality = 5,
	EQualityType__EPostProcessingQuality = 6,
	EQualityType__EFoliageQuality  = 7,
	EQualityType__EQualityType_MAX = 8
};


// Enum TslGame.ETeamVehicleType
enum class ETeamVehicleType : uint8_t
{
	ETeamVehicleType__Team_None    = 0,
	ETeamVehicleType__Team_Vehicle = 1,
	ETeamVehicleType__Team_Parachute = 2,
	ETeamVehicleType__Team_MAX     = 3
};


// Enum TslGame.ENearClippingLevel
enum class ENearClippingLevel : uint8_t
{
	ENearClippingLevel__Default    = 0,
	ENearClippingLevel__Low        = 1,
	ENearClippingLevel__Middle     = 2,
	ENearClippingLevel__High       = 3,
	ENearClippingLevel__ENearClippingLevel_MAX = 4
};


// Enum TslGame.EThingSpotGroupType
enum class EThingSpotGroupType : uint8_t
{
	EThingSpotGroupType__GroupA    = 0,
	EThingSpotGroupType__GroupB    = 1,
	EThingSpotGroupType__GroupC    = 2,
	EThingSpotGroupType__GroupD    = 3,
	EThingSpotGroupType__GroupE    = 4,
	EThingSpotGroupType__GroupF    = 5,
	EThingSpotGroupType__GroupG    = 6,
	EThingSpotGroupType__GroupH    = 7,
	EThingSpotGroupType__GroupI    = 8,
	EThingSpotGroupType__GroupJ    = 9,
	EThingSpotGroupType__GroupK    = 10,
	EThingSpotGroupType__GroupL    = 11,
	EThingSpotGroupType__GroupM    = 12,
	EThingSpotGroupType__GroupN    = 13,
	EThingSpotGroupType__EThingSpotGroupType_MAX = 14
};


// Enum TslGame.EPhysMaterialType
enum class EPhysMaterialType : uint8_t
{
	EPhysMaterialType__Unknown     = 0,
	EPhysMaterialType__Asphalt     = 1,
	EPhysMaterialType__Dirt        = 2,
	EPhysMaterialType__Water       = 3,
	EPhysMaterialType__Wood        = 4,
	EPhysMaterialType__Stone       = 5,
	EPhysMaterialType__Metal       = 6,
	EPhysMaterialType__EPhysMaterialType_MAX = 7
};


// Enum TslGame.EEquipableItemSoundType
enum class EEquipableItemSoundType : uint8_t
{
	EEquipableItemSoundType__None  = 0,
	EEquipableItemSoundType__Vest  = 1,
	EEquipableItemSoundType__LongCoat = 2,
	EEquipableItemSoundType__HipSack = 3,
	EEquipableItemSoundType__Cloth = 4,
	EEquipableItemSoundType__BackPack = 5,
	EEquipableItemSoundType__MilitaryShoes = 6,
	EEquipableItemSoundType__Sneakers = 7,
	EEquipableItemSoundType__EEquipableItemSoundType_MAX = 8
};


// Enum TslGame.EEquipableItemSoundGroup
enum class EEquipableItemSoundGroup : uint8_t
{
	EEquipableItemSoundGroup__Default = 0,
	EEquipableItemSoundGroup__Shoes = 1,
	EEquipableItemSoundGroup__EEquipableItemSoundGroup_MAX = 2
};


// Enum TslGame.EColorBlindType
enum class EColorBlindType : uint8_t
{
	EColorBlindType__Normal        = 0,
	EColorBlindType__Deuteranopia  = 1,
	EColorBlindType__Protanopia    = 2,
	EColorBlindType__Tritanopia    = 3,
	EColorBlindType__EColorBlindType_MAX = 4
};


// Enum TslGame.EFrameRateLimitType
enum class EFrameRateLimitType : uint8_t
{
	EFrameRateLimitType__Unlimited = 0,
	EFrameRateLimitType__Fixed     = 1,
	EFrameRateLimitType__Fixed01   = 2,
	EFrameRateLimitType__Customizable = 3,
	EFrameRateLimitType__DisplayBased = 4,
	EFrameRateLimitType__EFrameRateLimitType_MAX = 5
};


// Enum TslGame.ETslPhysMaterialType
enum class ETslPhysMaterialType : uint8_t
{
	ETslPhysMaterialType__Unknown  = 0,
	ETslPhysMaterialType__Concrete = 1,
	ETslPhysMaterialType__Dirt     = 2,
	ETslPhysMaterialType__Water    = 3,
	ETslPhysMaterialType__Metal    = 4,
	ETslPhysMaterialType__Wood     = 5,
	ETslPhysMaterialType__Grass    = 6,
	ETslPhysMaterialType__Glass    = 7,
	ETslPhysMaterialType__Flesh    = 8,
	ETslPhysMaterialType__ETslPhysMaterialType_MAX = 9
};


// Enum TslGame.ETppAimCameraPosition
enum class ETppAimCameraPosition : uint8_t
{
	ETppAimCameraPosition__LatestAimPosition = 0,
	ETppAimCameraPosition__LastPeekingPosition = 1,
	ETppAimCameraPosition__ResetToRightShoulderPosition = 2,
	ETppAimCameraPosition__ResetToLeftShoulderPosition = 3,
	ETppAimCameraPosition__ETppAimCameraPosition_MAX = 4
};


// Enum TslGame.ETargetingType
enum class ETargetingType : uint8_t
{
	ETargetingType__Targeting_None = 0,
	ETargetingType__Targeting_Aiming = 1,
	ETargetingType__Targeting_Scoping = 2,
	ETargetingType__Targeting_MAX  = 3
};


// Enum TslGame.EAccessorySlot
enum class EAccessorySlot : uint8_t
{
	EAccessorySlot__Slot_Primary   = 0,
	EAccessorySlot__Slot_Secondary = 1,
	EAccessorySlot__Slot_SideArm   = 2,
	EAccessorySlot__Slot_Melee     = 3,
	EAccessorySlot__Slot_Thrown    = 4,
	EAccessorySlot__Slot_None      = 5,
	EAccessorySlot__Slot_MAX       = 6
};


// Enum TslGame.ELobbyCharacterCameraType
enum class ELobbyCharacterCameraType : uint8_t
{
	ELobbyCharacterCameraType__None = 0,
	ELobbyCharacterCameraType__BodyCamera = 1,
	ELobbyCharacterCameraType__HeadCamera = 2,
	ELobbyCharacterCameraType__ELobbyCharacterCameraType_MAX = 3
};


// Enum TslGame.EWeaponClass
enum class EWeaponClass : uint8_t
{
	EWeaponClass__Class_None       = 0,
	EWeaponClass__Class_Pistol     = 1,
	EWeaponClass__Class_SMG        = 2,
	EWeaponClass__Class_Rifle      = 3,
	EWeaponClass__Class_Carbine    = 4,
	EWeaponClass__Class_Shotgun    = 5,
	EWeaponClass__Class_Sniper     = 6,
	EWeaponClass__Class_DMR        = 7,
	EWeaponClass__Class_LMG        = 8,
	EWeaponClass__Class_Melee      = 9,
	EWeaponClass__Class_Throwable  = 10,
	EWeaponClass__Class_Shield     = 11,
	EWeaponClass__Class_MAX        = 12
};


// Enum TslGame.EAttachmentCalculateType
enum class EAttachmentCalculateType : uint8_t
{
	EAttachmentCalculateType__Addition = 0,
	EAttachmentCalculateType__Multiply = 1,
	EAttachmentCalculateType__EAttachmentCalculateType_MAX = 2
};


// Enum TslGame.EFiringMode
enum class EFiringMode : uint8_t
{
	EFiringMode__Normal            = 0,
	EFiringMode__Burst             = 1,
	EFiringMode__FullAuto          = 2,
	EFiringMode__EFiringMode_MAX   = 3
};


// Enum TslGame.EWeaponHand
enum class EWeaponHand : uint8_t
{
	EWeaponHand__Left              = 0,
	EWeaponHand__Right             = 1,
	EWeaponHand__Total             = 2,
	EWeaponHand__EWeaponHand_MAX   = 3
};


// Enum TslGame.EAnimWeaponType
enum class EAnimWeaponType : uint8_t
{
	EAnimWeaponType__None          = 0,
	EAnimWeaponType__Rifle         = 1,
	EAnimWeaponType__Pistol        = 2,
	EAnimWeaponType__Throwable     = 3,
	EAnimWeaponType__Melee         = 4,
	EAnimWeaponType__Shield        = 5,
	EAnimWeaponType__EAnimWeaponType_MAX = 6
};


// Enum TslGame.ECameraViewBehaviour
enum class ECameraViewBehaviour : uint8_t
{
	ECameraViewBehaviour__FpsAndTps = 0,
	ECameraViewBehaviour__FpsOnly  = 1,
	ECameraViewBehaviour__TpsOnly  = 2,
	ECameraViewBehaviour__ECameraViewBehaviour_MAX = 3
};


// Enum TslGame.EPlayerStartType
enum class EPlayerStartType : uint8_t
{
	EPlayerStartType__OnePlace     = 0,
	EPlayerStartType__SeveralPlace = 1,
	EPlayerStartType__EPlayerStartType_MAX = 2
};


// Enum TslGame.EMatchStartType
enum class EMatchStartType : uint8_t
{
	EMatchStartType__Normal        = 0,
	EMatchStartType__Airborne      = 1,
	EMatchStartType__EMatchStartType_MAX = 2
};


// Enum TslGame.EGender
enum class EGender : uint8_t
{
	EGender__Male                  = 0,
	EGender__Female                = 1,
	EGender__EGender_MAX           = 2
};


// Enum TslGame.EKillcamDisplayCode
enum class EKillcamDisplayCode : uint8_t
{
	EKillcamDisplayCode__NotVisible = 0,
	EKillcamDisplayCode__OptionDisabled = 1,
	EKillcamDisplayCode__Recording = 2,
	EKillcamDisplayCode__Playable  = 3,
	EKillcamDisplayCode__Replay    = 4,
	EKillcamDisplayCode__FailToLoad = 5,
	EKillcamDisplayCode__DemoFailure = 6,
	EKillcamDisplayCode__DetectedUnusualMovement = 7,
	EKillcamDisplayCode__EKillcamDisplayCode_MAX = 8
};


// Enum TslGame.EWidgetShowType
enum class EWidgetShowType : uint8_t
{
	EWidgetShowType__Show          = 0,
	EWidgetShowType__Hide          = 1,
	EWidgetShowType__Toggle        = 2,
	EWidgetShowType__EWidgetShowType_MAX = 3
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct TslGame.TslImpactSoundInfo
// 0x0060
struct FTslImpactSoundInfo
{
	class UAkAudioEvent*                               DefaultSoundAk;                                           // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               ConcreteSoundAk;                                          // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               DirtSoundAk;                                              // 0x0010(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               WaterSoundAk;                                             // 0x0018(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               MetalSoundAk;                                             // 0x0020(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               WoodSoundAk;                                              // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               GrassSoundAk;                                             // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               GlassSoundAk;                                             // 0x0038(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               FleshSoundAk;                                             // 0x0040(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               RockSoundAk;                                              // 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               SandSoundAk;                                              // 0x0050(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               MudSoundAk;                                               // 0x0058(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.AnimUpdateRateSettings
// 0x0078
struct FAnimUpdateRateSettings
{
	bool                                               bUseLookAheadMode;                                        // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bShouldUseLodMap;                                         // 0x0001(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0002(0x0006) MISSED OFFSET
	TMap<int, int>                                     LODToFrameSkipMap;                                        // 0x0008(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	int                                                BaseNonRenderedUpdateRate;                                // 0x0058(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x005C(0x0004) MISSED OFFSET
	TArray<float>                                      BaseVisibleDistanceFactorThesholds;                       // 0x0060(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	int                                                MaxEvalRateForInterpolation;                              // 0x0070(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0074(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.MotoRollDampSettings
// 0x001C
struct FMotoRollDampSettings
{
	bool                                               bVelDampening;                                            // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              StabilizeAirPercentage;                                   // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              StabilizeAirTorquePercentage;                             // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollVelDampeningContact;                                  // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollVelDampeningNoContact;                                // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollVelDampeningInterp;                                   // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseLinearInterp;                                         // 0x0018(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0019(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.StatTrakData
// 0x0004
struct FStatTrakData
{
	int                                                NumKills;                                                 // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct TslGame.StatTrakDataPair
// 0x0018
struct FStatTrakDataPair
{
	class FString                                      Key;                                                      // 0x0000(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient)
	struct FStatTrakData                               BeginStatTrakData;                                        // 0x0010(0x0004) (BlueprintVisible, BlueprintReadOnly, Transient)
	struct FStatTrakData                               CountStatTrakData;                                        // 0x0014(0x0004) (BlueprintVisible, BlueprintReadOnly, Transient)
};

// ScriptStruct TslGame.VoiceConnectionInfo
// 0x0068
struct FVoiceConnectionInfo
{
	class FString                                      ServerURL;                                                // 0x0000(0x0010) (ZeroConstructor)
	class FString                                      Domain;                                                   // 0x0010(0x0010) (ZeroConstructor)
	bool                                               bIsEnableGVoice;                                          // 0x0020(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	class FString                                      GVoiceServerUrl;                                          // 0x0028(0x0010) (ZeroConstructor)
	class FString                                      GVoiceAppKey;                                             // 0x0038(0x0010) (ZeroConstructor)
	class FString                                      GVoiceAppId;                                              // 0x0048(0x0010) (ZeroConstructor)
	int                                                GVoiceProximalMaxRange;                                   // 0x0058(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                GVoiceDistNear;                                           // 0x005C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                GVoiceDistFar;                                            // 0x0060(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              GVoiceVolPercentage;                                      // 0x0064(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.TslWeaponAnimInfo
// 0x0020
struct FTslWeaponAnimInfo
{
	unsigned char                                      bIsArmed : 1;                                             // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bIsGun : 1;                                               // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bIsHipped : 1;                                            // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	EWeaponClass                                       WeaponClass;                                              // 0x0004(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EWeaponClass                                       LobbyAnimationClass;                                      // 0x0005(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EAnimWeaponType                                    AnimWeaponType;                                           // 0x0006(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x0007(0x0001) MISSED OFFSET
	class UBlendSpace1D*                               GripBlendspace;                                           // 0x0008(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UBlendSpaceBase*                             LHGripBlendspace;                                         // 0x0010(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	int                                                GripTypeIndex;                                            // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.PhysicalMaterialPenetrationConfig
// 0x0008
struct FPhysicalMaterialPenetrationConfig
{
	float                                              Resistanse;                                               // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Deflection;                                               // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.WeaponPenetrationConfig
// 0x0050
struct FWeaponPenetrationConfig
{
	TMap<TEnumAsByte<EPhysicalSurface>, float>         PowerMultipliers;                                         // 0x0000(0x0050) (Edit, ZeroConstructor)
};

// ScriptStruct TslGame.WheelTypeInfo
// 0x0028
struct FWheelTypeInfo
{
	unsigned char                                      AtlasIndex;                                               // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	TArray<class UClass*>                              WheelTypes;                                               // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<class UClass*>                              ExemptedWheelTypes;                                       // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct TslGame.AnimSpeedInfo
// 0x0020
struct FAnimSpeedInfo
{
	float                                              F;                                                        // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              L;                                                        // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              R;                                                        // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              B;                                                        // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FL;                                                       // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FR;                                                       // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BL;                                                       // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BR;                                                       // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.AnimInfo
// 0x0068
struct FAnimInfo
{
	class UBlendSpace*                                 BlendSpaceRef;                                            // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpace*                                 BlendSpaceFPPRef;                                         // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpace*                                 BlendSpaceRelaxedRef;                                     // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpace*                                 BlendSpaceRelaxedFPPRef;                                  // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FAnimSpeedInfo                              AnimSpeed_Walk;                                           // 0x0020(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FAnimSpeedInfo                              AnimSpeed_Run;                                            // 0x0040(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	float                                              AnimSpeed_Sprint;                                         // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0064(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.BinaryData
// 0x0010
struct FBinaryData
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct TslGame.LobbyItemDesc
// 0x0060
struct FLobbyItemDesc
{
	unsigned char                                      bCashSellable : 1;                                        // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bPointSellable : 1;                                       // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bMarketable : 1;                                          // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bPointRefundable : 1;                                     // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class FString                                      XboxConsumableId;                                         // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	ELobbyItemTier                                     Tier;                                                     // 0x0018(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	ELobbyItemCategory                                 Category;                                                 // 0x0019(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x001A(0x0006) MISSED OFFSET
	struct FText                                       Description;                                              // 0x0020(0x0018) (Edit, DisableEditOnInstance)
	bool                                               bTradeUpResult;                                           // 0x0038(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bTradeUpMaterial;                                         // 0x0039(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x003A(0x0006) MISSED OFFSET
	TArray<ELobbyItemPlatform>                         Platforms;                                                // 0x0040(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              CashSellingPrice;                                         // 0x0050(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	ELobbyItemPointSellingType                         PointSellingType;                                         // 0x0054(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0055(0x0003) MISSED OFFSET
	int                                                PointSellingPrice;                                        // 0x0058(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                PointRefundingPrice;                                      // 0x005C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.WeaponPPSettings
// 0x0090
struct FWeaponPPSettings
{
	float                                              BlurLevel;                                                // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ScopeRadiusNear;                                          // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ScopeRadiusFar;                                           // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   ReticleRect;                                              // 0x000C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	float                                              ReticleAngularSize;                                       // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                ReticleTint;                                              // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	float                                              ReticleGamma;                                             // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	class UTexture*                                    ReticleTexture;                                           // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UReticleSettings*                            ReticleSettings;                                          // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ScopeLensDistortion;                                      // 0x0040(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ScopeLensCA;                                              // 0x0044(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                ScopeLensTint;                                            // 0x0048(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	float                                              ScopeOuterBrightness;                                     // 0x0058(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DepthBlurPower;                                           // 0x005C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DepthBlurWhitePoint;                                      // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DepthBlurBlackPoint;                                      // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   RelativeOffsetMap;                                        // 0x0068(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	float                                              ParallaxMovementScale;                                    // 0x0070(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParallaxRadiusScale;                                      // 0x0074(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BloomIntensity;                                           // 0x0078(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              NearClipStaticOffset;                                     // 0x007C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              NearClipMinClamp;                                         // 0x0080(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     WeaponCycleCameraOffset;                                  // 0x0084(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ReticleTextureData
// 0x0030
struct FReticleTextureData
{
	float                                              ReticleAngularSize;                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   ReticleCenter;                                            // 0x0004(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	class UTexture2D*                                  ReticleTexture;                                           // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseHaloTexture;                                          // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0019(0x0003) MISSED OFFSET
	float                                              HaloTextureScale;                                         // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     ReticleColor;                                             // 0x0020(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	float                                              ReticleScale;                                             // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.BrightnessConfig
// 0x0020
struct FBrightnessConfig
{
	class UCurveVector*                                ReticleBrightnessSettingsCurve;                           // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       ReticleBrightnessParamX;                                  // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       ReticleBrightnessParamY;                                  // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       ReticleBrightnessParamZ;                                  // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ScopeGlintConfig
// 0x003C
struct FScopeGlintConfig
{
	bool                                               GlintEnabled;                                             // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FVector2D                                   GlintStartFade;                                           // 0x0004(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     ScopeEndPositionLS;                                       // 0x000C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	float                                              ScopeRadiusLS;                                            // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GlintRadiusScreen;                                        // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ScopeRadiusScreen;                                        // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                GlintColor;                                               // 0x0024(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   GlintVisibilityArcLength;                                 // 0x0034(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.WeaponAttachmentData
// 0x02C8
struct FWeaponAttachmentData
{
	EWeaponAttachmentSlotID                            AttachmentSlotID;                                         // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FName                                       AttachmentTag;                                            // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       Name;                                                     // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FName                                       MouseSensitiveName;                                       // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MagnificationFOVMaxIncrement;                             // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                MagnificationFOVSteps;                                    // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MagnificationFOV;                                         // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	struct FBrightnessConfig                           ReticleBrightnessConfig;                                  // 0x0030(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TArray<float>                                      ZeroingDistances;                                         // 0x0050(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TMap<class UClass*, class UMaterialInstance*>      ReticleMaterialOverrides;                                 // 0x0060(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	TMap<class UClass*, class UTexture2D*>             ReticleTextureOverrides;                                  // 0x00B0(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	TMap<class UClass*, class UReticleSettings*>       ReticleSettingsOverrides;                                 // 0x0100(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UReticlePostprocessData*                     ScopePostprocessData;                                     // 0x0150(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DecreaseRecoilPatternScale;                               // 0x0158(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                AmmoPerClip;                                              // 0x015C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ReloadAnimationPlayRate;                                  // 0x0160(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MultipleFiringBulletsSpread;                              // 0x0164(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MultipleFiringSpreadBase;                                 // 0x0168(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MultipleAmmoSpeed;                                        // 0x016C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RecoilMultiplierHorizontal;                               // 0x0170(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RecoilMultiplierVertical;                                 // 0x0174(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RecoilRecoveryMultiplier;                                 // 0x0178(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SwayMultiplier;                                           // 0x017C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AnimationKickMultiplier;                                  // 0x0180(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeviationMultiplier;                                      // 0x0184(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ADSSpeedMultiplier;                                       // 0x0188(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     FPPSocketOffset;                                          // 0x018C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	int                                                GripType_MN;                                              // 0x0198(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BarrelLengthAdditive;                                     // 0x019C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UParticleSystem*                             MuzzleFx;                                                 // 0x01A0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       MuzzleAttachPoint;                                        // 0x01A8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     IKHandOffset;                                             // 0x01B0(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    IKHandRotation;                                           // 0x01BC(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	EWeaponGripLeftHand                                WeaponGripLeft;                                           // 0x01C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsSuppressor;                                            // 0x01C9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x01CA(0x0006) MISSED OFFSET
	class UAkAudioEvent*                               MuzzleSound;                                              // 0x01D0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                CharacterReloadTactical;                                  // 0x01D8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                WeaponReloadTactical;                                     // 0x01E0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                CharacterReloadCharge;                                    // 0x01E8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                WeaponReloadCharge;                                       // 0x01F0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseCustomADSAlpha;                                       // 0x01F8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x01F9(0x0007) MISSED OFFSET
	class UCurveVector*                                ADSAlphaVectorCurve;                                      // 0x0200(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUsePelletGridOverride;                                   // 0x0208(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0209(0x0007) MISSED OFFSET
	TMap<int, struct FVector2D>                        PelletGridOverride;                                       // 0x0210(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              StabilitySpeedScalar;                                     // 0x0260(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              StabilityMinForceAdditive;                                // 0x0264(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RecoilEarlyExitScale;                                     // 0x0268(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CantedWeaponRotation;                                     // 0x026C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseReticleTypeOverride;                                  // 0x0270(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseDefaultReticleCaching;                                // 0x0271(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x6];                                       // 0x0272(0x0006) MISSED OFFSET
	TArray<struct FReticleTextureData>                 ReticleTextureDataArray;                                  // 0x0278(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	struct FScopeGlintConfig                           ScopeGlintConfig;                                         // 0x0288(0x003C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      UnknownData06[0x4];                                       // 0x02C4(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.WeaponAttachmentWeaponTagData
// 0x0300
struct FWeaponAttachmentWeaponTagData
{
	struct FName                                       WeaponTag;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TAssetPtr<class UStaticMesh>                       AttachmentMeshAsset;                                      // 0x0008(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FWeaponAttachmentData                       AttachmentData;                                           // 0x0028(0x02C8) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FName                                       AttachmentMeshName;                                       // 0x02F0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      AttachmentTemplate;                                       // 0x02F8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.TslInputKey
// 0x0020
struct FTslInputKey
{
	struct FKey                                        Key;                                                      // 0x0000(0x0018) (Edit, BlueprintVisible)
	unsigned char                                      bShift : 1;                                               // 0x0018(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bCtrl : 1;                                                // 0x0018(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bAlt : 1;                                                 // 0x0018(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct TslGame.CustomActionKeyData
// 0x0018
struct FCustomActionKeyData
{
	struct FName                                       ActionName;                                               // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<struct FTslInputKey>                        Keys;                                                     // 0x0008(0x0010) (ZeroConstructor)
};

// ScriptStruct TslGame.CustomAxisKeyData
// 0x0020
struct FCustomAxisKeyData
{
	struct FName                                       AxisName;                                                 // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              Scale;                                                    // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	TArray<struct FTslInputKey>                        Keys;                                                     // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct TslGame.CustomMouseSensitiveData
// 0x0010
struct FCustomMouseSensitiveData
{
	struct FName                                       MouseSensitiveName;                                       // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              MouseSensitivity;                                         // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LastConvertedMouseSensitivity;                            // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.CustomGamePadSensitiveData
// 0x0010
struct FCustomGamePadSensitiveData
{
	struct FName                                       GamePadSensitiveName;                                     // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              GamePadSensitivity;                                       // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LastConvertedGamePadSensitivity;                          // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.CustomSensitiveData
// 0x0010
struct FCustomSensitiveData
{
	struct FName                                       SensitiveName;                                            // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              Sensitivity;                                              // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LastConvertedSensitivity;                                 // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.CustomSensitiveDataArray
// 0x0010
struct FCustomSensitiveDataArray
{
	TArray<struct FCustomSensitiveData>                Array;                                                    // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct TslGame.CustomInputSettings
// 0x00D8
struct FCustomInputSettings
{
	TArray<struct FCustomActionKeyData>                ActionKeyList;                                            // 0x0000(0x0010) (ZeroConstructor, Config)
	TArray<struct FCustomAxisKeyData>                  AxisKeyList;                                              // 0x0010(0x0010) (ZeroConstructor, Config)
	bool                                               bIsUsingPerScopeMouseSensitivity;                         // 0x0020(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bIsUsingPerScopeGamepadSensitivity;                       // 0x0021(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0022(0x0006) MISSED OFFSET
	TArray<struct FCustomMouseSensitiveData>           MouseSensitiveList;                                       // 0x0028(0x0010) (ZeroConstructor, Config)
	TArray<struct FCustomGamePadSensitiveData>         GamePadSensitiveList;                                     // 0x0038(0x0010) (ZeroConstructor, Config)
	TMap<ETslControllerType, struct FCustomSensitiveDataArray> SensitiveMap;                                             // 0x0048(0x0050) (ZeroConstructor, Config)
	float                                              MouseVerticalSensitivityMultiplierAdjusted;               // 0x0098(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bInvertMouse;                                             // 0x009C(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bInvertGamePadY;                                          // 0x009D(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bInvertGamePadX;                                          // 0x009E(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x009F(0x0001) MISSED OFFSET
	float                                              GamePadDeadZone;                                          // 0x00A0(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              GamepadVerticalSensitivityMultiplier;                     // 0x00A4(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              StartRunningSensitivity;                                  // 0x00A8(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              GamePadDeadZone_Left;                                     // 0x00AC(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bEnableAimAccPad;                                         // 0x00B0(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData02[0x27];                                      // 0x00B1(0x0027) MISSED OFFSET
};

// ScriptStruct TslGame.TslPersistantData
// 0x0138
struct FTslPersistantData
{
	struct FCustomInputSettings                        CustomInputSettings;                                      // 0x0000(0x00D8) (Config)
	bool                                               bUseForceFeedback;                                        // 0x00D8(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	EGamepadPresets                                    GamepadPresetType;                                        // 0x00D9(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x00DA(0x0002) MISSED OFFSET
	float                                              ForceFeedbackMultiplier;                                  // 0x00DC(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              FpsCameraFov;                                             // 0x00E0(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              Gamma;                                                    // 0x00E4(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bIsMasterSoundMute;                                       // 0x00E8(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bIsEffectSoundMute;                                       // 0x00E9(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bIsUISoundMute;                                           // 0x00EA(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bIsBGMSoundMute;                                          // 0x00EB(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bIsEnabledHrtfRemoteWeaponSound;                          // 0x00EC(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x00ED(0x0003) MISSED OFFSET
	class FString                                      CultureName;                                              // 0x00F0(0x0010) (ZeroConstructor, Config)
	bool                                               bIconKillfeedEnabled;                                     // 0x0100(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0101(0x0003) MISSED OFFSET
	int                                                ColorBlindType;                                           // 0x0104(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	class FString                                      CrosshairColorString;                                     // 0x0108(0x0010) (ZeroConstructor, Config)
	struct FColor                                      CustomCrosshairColor;                                     // 0x0118(0x0004) (Config, IsPlainOldData)
	bool                                               bUseKeyHint;                                              // 0x011C(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	ETppAimCameraPosition                              TppAimCamPosRecoveryType;                                 // 0x011D(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x011E(0x0002) MISSED OFFSET
	float                                              ForwardRunningSensitivity;                                // 0x0120(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              MasterSoundVolume;                                        // 0x0124(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              EffectSoundVolume;                                        // 0x0128(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              UISoundVolume;                                            // 0x012C(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              BGMSoundVolume;                                           // 0x0130(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bUseRes4K;                                                // 0x0134(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bAutoReloadOnOutOfAmmoFire;                               // 0x0135(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bShowCompassShade;                                        // 0x0136(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData04[0x1];                                       // 0x0137(0x0001) MISSED OFFSET
};

// ScriptStruct TslGame.SavedObPos
// 0x0018
struct FSavedObPos
{
	struct FVector                                     Loc;                                                      // 0x0000(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	struct FRotator                                    Rot;                                                      // 0x000C(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
};

// ScriptStruct TslGame.SavedObPosMapConfig
// 0x0020
struct FSavedObPosMapConfig
{
	class FString                                      MapName;                                                  // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FSavedObPos>                         SavedObPos;                                               // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct TslGame.OutgameUserData
// 0x0020
struct FOutgameUserData
{
	class FString                                      Key;                                                      // 0x0000(0x0010) (ZeroConstructor)
	class FString                                      Value;                                                    // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct TslGame.TracerModeType
// 0x0008
struct FTracerModeType
{
	int                                                Mode;                                                     // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                Type;                                                     // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.TracerSimulationData
// 0x0030
struct FTracerSimulationData
{
	struct FVector                                     ServerStartTrace;                                         // 0x0000(0x000C) (IsPlainOldData)
	struct FVector                                     Dir;                                                      // 0x000C(0x000C) (IsPlainOldData)
	struct FAttackId                                   AttackId;                                                 // 0x0018(0x0004)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	class UClass*                                      WeaponClass;                                              // 0x0020(0x0008) (ZeroConstructor, IsPlainOldData)
	class AActor*                                      Instigator;                                               // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.TracerSimulationServerData
// 0x0008 (0x0038 - 0x0030)
struct FTracerSimulationServerData : public FTracerSimulationData
{
	float                                              LatencyOffset;                                            // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.NearClippingLevelOverZ
// 0x0008
struct FNearClippingLevelOverZ
{
	float                                              Z;                                                        // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	ENearClippingLevel                                 Level;                                                    // 0x0004(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.TslItemStringClass
// 0x0010
struct FTslItemStringClass
{
	struct FStringClassReference                       ItemClass;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct TslGame.TslPlayerMatchResultInfo
// 0x0028
struct FTslPlayerMatchResultInfo
{
	class FString                                      PlayerName;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                NumKills;                                                 // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Ranking;                                                  // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TeamId;                                                   // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NumStartTeamMember;                                       // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsZombie;                                                // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
};

// ScriptStruct TslGame.TslReportUserInfo
// 0x0038
struct FTslReportUserInfo
{
	class FString                                      PlayerName;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class FString                                      NetId;                                                    // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class FString                                      AccountId;                                                // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                TeamId;                                                   // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	ESubjectToReport                                   SubjectToReport;                                          // 0x0034(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0035(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.TslPlayerStatistics
// 0x0004
struct FTslPlayerStatistics
{
	int                                                NumKills;                                                 // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.TslPlayerStatisticsForOwner
// 0x0010
struct FTslPlayerStatisticsForOwner
{
	float                                              TotalMovedDistanceMeter;                                  // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              TotalGivenDamages;                                        // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LongestDistanceKill;                                      // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                HeadShots;                                                // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.TakeHitInfo
// 0x0058
struct FTakeHitInfo
{
	float                                              ActualDamage;                                             // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class UClass*                                      DamageType;                                               // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class ATslPlayerState>              PlayerInstigator;                                         // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FVector_NetQuantize                         DamageOrigin;                                             // 0x0018(0x000C)
	struct FVector_NetQuantize                         RelHitLocation;                                           // 0x0024(0x000C)
	struct FName                                       BoneName;                                                 // 0x0030(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              DamageMaxRadius;                                          // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      ShotDirPitch;                                             // 0x003C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      ShotDirYaw;                                               // 0x003D(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      bPointDamage : 1;                                         // 0x003E(0x0001)
	unsigned char                                      bRadialDamage : 1;                                        // 0x003E(0x0001)
	unsigned char                                      bKilled : 1;                                              // 0x003E(0x0001)
	unsigned char                                      EnsureReplicationByte;                                    // 0x003F(0x0001) (ZeroConstructor, IsPlainOldData)
	struct FName                                       AttackerWeaponName;                                       // 0x0040(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     AttackerLocation;                                         // 0x0048(0x000C) (IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.DisplayActorNames
// 0x0020
struct FTslGame_FDisplayActorNames
{
	class FString                                      ActorName;                                                // 0x0000(0x0010) (ZeroConstructor)
	struct FVector                                     ActorLocation;                                            // 0x0010(0x000C) (IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.SkinParam
// 0x0010
struct FSkinParam
{
	ESkinCategory                                      SkinCategory;                                             // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FName                                       SkinName;                                                 // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.WeaponAttachmentAssetData
// 0x0040
struct FWeaponAttachmentAssetData
{
	EWeaponAttachmentSlotID                            AttachmentSlotID;                                         // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FName                                       AttachmentTag;                                            // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TAssetPtr<class UStaticMesh>                       AttachmentMeshAsset;                                      // 0x0010(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FName                                       AttachmentMeshName;                                       // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      AttachmentTemplate;                                       // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ReplicatedSkinParam
// 0x0020
struct FReplicatedSkinParam
{
	class UClass*                                      SkinItemClass;                                            // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FSkinParam                                  SkinParam;                                                // 0x0008(0x0010) (Transient)
	int                                                SkinOwnerPlayerId;                                        // 0x0018(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.WeaponBasicAnim
// 0x0018
struct FWeaponBasicAnim
{
	class UAnimMontage*                                PullOut;                                                  // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                PutIn;                                                    // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                Pickup;                                                   // 0x0010(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.WeaponRollAnim
// 0x0010
struct FWeaponRollAnim
{
	class UAnimMontage*                                RollLeft;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                RollRight;                                                // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.WeaponAttachmentTagPositionData
// 0x0010
struct FWeaponAttachmentTagPositionData
{
	struct FName                                       AttachmentTag;                                            // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       AttachmentPoint;                                          // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.WeaponAttachmentPositionData
// 0x0020
struct FWeaponAttachmentPositionData
{
	EWeaponAttachmentSlotID                            AttachmentSlotID;                                         // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FName                                       AttachmentPoint;                                          // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FWeaponAttachmentTagPositionData>    AttachmentPointByTag;                                     // 0x0010(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct TslGame.WeaponData
// 0x0108
struct FWeaponData
{
	float                                              TargetingFOV;                                             // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HoldBreathFOV;                                            // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       Rarity;                                                   // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     SocketOffset_Shoulder;                                    // 0x0010(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     SocketOffset_Hand;                                        // 0x001C(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	bool                                               bApplyGripPoseLeft;                                       // 0x0028(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EWeaponGripLeftHand                                WeaponGripLeft;                                           // 0x0029(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EWeaponClass                                       WeaponClass;                                              // 0x002A(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EWeaponClass                                       AnimationWeaponClassOverride;                             // 0x002B(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAlwaysArmed;                                             // 0x002C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseDefaultScoreMultiplier;                               // 0x002D(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x002E(0x0002) MISSED OFFSET
	float                                              ScoreMultiplierByDamage;                                  // 0x0030(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ScoreMultiplierByKill;                                    // 0x0034(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SwayModifier_Pitch;                                       // 0x0038(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SwayModifier_YawOffset;                                   // 0x003C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SwayModifier_Movement;                                    // 0x0040(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SwayModifier_Stand;                                       // 0x0044(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SwayModifier_Crouch;                                      // 0x0048(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SwayModifier_Prone;                                       // 0x004C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CameraDOF_Range;                                          // 0x0050(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CameraDOF_NearRange;                                      // 0x0054(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CameraDOF_Power;                                          // 0x0058(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseDynamicReverbAK;                                      // 0x005C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x005D(0x0003) MISSED OFFSET
	TArray<float>                                      IronSightZeroingDistances;                                // 0x0060(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              AnimationKick;                                            // 0x0070(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0074(0x0004) MISSED OFFSET
	class UAnimMontage*                                RecoilMontage;                                            // 0x0078(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               DestructibleDoor;                                         // 0x0080(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EThrownWeaponType                                  ThrownType;                                               // 0x0081(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x0082(0x0002) MISSED OFFSET
	float                                              WeaponEquipDuration;                                      // 0x0084(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WeaponUnequipDuration;                                    // 0x0088(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WeaponBoltActionTrigger;                                  // 0x008C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WeaponReadyDuration;                                      // 0x0090(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bForceFireAfterEquip;                                     // 0x0094(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0095(0x0003) MISSED OFFSET
	float                                              PhysicalBodyHitImpactPower;                               // 0x0098(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x4];                                       // 0x009C(0x0004) MISSED OFFSET
	struct FName                                       WeaponSensitivityOverride;                                // 0x00A0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x50];                                      // 0x00A8(0x0050) UNKNOWN PROPERTY: SetProperty TslGame.WeaponData.RestrictedStances
	float                                              MovementModifierRunning;                                  // 0x00F8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MovementModifierSprinting;                                // 0x00FC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MovementModifierJumpVelocity;                             // 0x0100(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bBlockPeeking;                                            // 0x0104(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x0105(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.WeaponGunConfigReplacement
// 0x0118
struct FWeaponGunConfigReplacement
{
	class UClass*                                      AmmoItemClass;                                            // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UParticleSystem*                             TracerClass;                                              // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                AmmoPerClip;                                              // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TimeBetweenShots;                                         // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseTimeBetweenBursts;                                    // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0019(0x0003) MISSED OFFSET
	float                                              TimeBetweenBursts;                                        // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              NoAnimReloadDuration;                                     // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
	TArray<EFiringMode>                                FiringModes;                                              // 0x0028(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	int                                                BurstShots;                                               // 0x0038(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BurstDelay;                                               // 0x003C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                BulletPerFiring;                                          // 0x0040(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FiringBulletsSpread;                                      // 0x0044(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsArrowProjectile;                                       // 0x0048(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bRotationFromBarrelWhenScoped;                            // 0x0049(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EWeaponReloadMethod                                ReloadMethod;                                             // 0x004A(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x1];                                       // 0x004B(0x0001) MISSED OFFSET
	float                                              ReloadDurationByOneInitial;                               // 0x004C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ReloadDurationByOneLoop;                                  // 0x0050(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MovementModifierAim;                                      // 0x0054(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MovementModifierScope;                                    // 0x0058(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WeaponLength;                                             // 0x005C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ShoulderLength;                                           // 0x0060(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WeaponToShoulderOffset;                                   // 0x0064(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WeaponSuppressorLength;                                   // 0x0068(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TraceRadius;                                              // 0x006C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TraceAdditiveZ;                                           // 0x0070(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               DebugWeaponCollision;                                     // 0x0074(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0075(0x0003) MISSED OFFSET
	struct FVector                                     HandWeaponOffset;                                         // 0x0078(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     HandWeaponOffsetFPP;                                      // 0x0084(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	bool                                               bManualCycleAfterShot;                                    // 0x0090(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bManualCycleInitialStateReady;                            // 0x0091(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x2];                                       // 0x0092(0x0002) MISSED OFFSET
	float                                              LongTailDelay;                                            // 0x0094(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseConstScope;                                           // 0x0098(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseGridPelletSpread;                                     // 0x0099(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x6];                                       // 0x009A(0x0006) MISSED OFFSET
	TMap<int, struct FVector2D>                        PelletGrid;                                               // 0x00A0(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              GridPelletSpreadHalfAngle;                                // 0x00F0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              StabilitySpeedModifier;                                   // 0x00F4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              StabilityForceModifier;                                   // 0x00F8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseReloadScalarOverride;                                 // 0x00FC(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x00FD(0x0003) MISSED OFFSET
	float                                              ReloadSpeedScalar;                                        // 0x0100(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ADSTimeMultiplier;                                        // 0x0104(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseInertiaPitchAdditive;                                 // 0x0108(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x0109(0x0003) MISSED OFFSET
	float                                              InertiaPitchAdditiveInterpSpeed;                          // 0x010C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseTracerParticle;                                       // 0x0110(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData08[0x7];                                       // 0x0111(0x0007) MISSED OFFSET
};

// ScriptStruct TslGame.WeaponDeviationConfig
// 0x0044
struct FWeaponDeviationConfig
{
	float                                              DeviationBase;                                            // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeviationBaseAim;                                         // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeviationBaseADS;                                         // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MOA;                                                      // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeviationRecoilGain;                                      // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeviationRecoilGainAim;                                   // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeviationRecoilGainADS;                                   // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeviationMax;                                             // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeviationMinMove;                                         // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeviationMaxMove;                                         // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeviationMoveMultiplier;                                  // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeviationMoveMinReferenceVelocity;                        // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeviationMoveMaxReferenceVelocity;                        // 0x0030(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeviationStanceStand;                                     // 0x0034(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeviationStanceCrouch;                                    // 0x0038(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeviationStanceProne;                                     // 0x003C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeviationStanceJump;                                      // 0x0040(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.WeaponAnimConfig
// 0x0118
struct FWeaponAnimConfig
{
	class UAnimMontage*                                Fire;                                                     // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bLoopedFire : 1;                                          // 0x0008(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	class UAnimMontage*                                Reload;                                                   // 0x0010(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpace1D*                               CharacterGripBlendspace;                                  // 0x0018(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpaceBase*                             CharacterLHGripBlendspace;                                // 0x0020(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                CharacterFire;                                            // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                CharacterFireCycle;                                       // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                CharacterFireSelector;                                    // 0x0038(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                CharacterReloadTactical;                                  // 0x0040(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                CharacterReloadCharge;                                    // 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                CharacterReloadByOneStart;                                // 0x0050(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                CharacterReloadByOneStop;                                 // 0x0058(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                CharacterReloadByOneSingle;                               // 0x0060(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                WeaponReloadTactical;                                     // 0x0068(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                WeaponReloadCharge;                                       // 0x0070(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EWeaponClass                                       LobbyAnimClassOverride;                                   // 0x0078(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseLobbyAnimClassOverride;                               // 0x0079(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x007A(0x0002) MISSED OFFSET
	float                                              ReloadDurationTactical;                                   // 0x007C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ReloadDurationCharge;                                     // 0x0080(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ReloadDurationStart;                                      // 0x0084(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ReloadDurationLoop;                                       // 0x0088(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ReloadDurationMagOut;                                     // 0x008C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseBoltAction;                                           // 0x0090(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0091(0x0003) MISSED OFFSET
	float                                              FireCycleDelay;                                           // 0x0094(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FireCycleDuration;                                        // 0x0098(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CycleAfterReloadDelay;                                    // 0x009C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bCycleAfterLastShot;                                      // 0x00A0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bCycleDuringReload;                                       // 0x00A1(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x6];                                       // 0x00A2(0x0006) MISSED OFFSET
	class UClass*                                      ShotCameraShake;                                          // 0x00A8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ShotCameraShakeIronsight;                                 // 0x00B0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ShotCameraShakeADS;                                       // 0x00B8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UCameraAnim*                                 CycleCameraAnim;                                          // 0x00C0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RecoilKickADS;                                            // 0x00C8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RecoilKick_MovementSpeedMax;                              // 0x00CC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RecoilKick_MovementMaxMultiplier;                         // 0x00D0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     RecoilADSSocketOffsetScale;                               // 0x00D4(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     MagDropLinearVelocity;                                    // 0x00E0(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     MagDropAngularVelocity;                                   // 0x00EC(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              InertiaInterpMultiplier;                                  // 0x00F8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InertiaClampMultiplier;                                   // 0x00FC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseBurstRecoilMap;                                       // 0x0100(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0101(0x0003) MISSED OFFSET
	struct FVector2D                                   BurstRecoilInMap;                                         // 0x0104(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   BurstRecoilOutMap;                                        // 0x010C(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x4];                                       // 0x0114(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.WeaponGunData
// 0x0008
struct FWeaponGunData
{
	float                                              TimeBetweenShots;                                         // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                BulletPerFiring;                                          // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.WeaponArmInfo
// 0x0004
struct FWeaponArmInfo
{
	unsigned char                                      ServerUpdateSeqNum;                                       // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	int8_t                                             RightWeaponIndex;                                         // 0x0001(0x0001) (ZeroConstructor, IsPlainOldData)
	int8_t                                             LeftWeaponIndex;                                          // 0x0002(0x0001) (ZeroConstructor, IsPlainOldData)
	EWeaponTransitionState                             State;                                                    // 0x0003(0x0001) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.EmoteTraceCheck
// 0x001C
struct FEmoteTraceCheck
{
	struct FVector                                     InitialActorOffset;                                       // 0x0000(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     TraceVector;                                              // 0x000C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	float                                              SphereRadius;                                             // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.StanceTransition
// 0x0010
struct FStanceTransition
{
	class UAnimMontage*                                TransitionAnim;                                           // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               CanPlayInMoving;                                          // 0x0008(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
};

// ScriptStruct TslGame.StanceTransitionData
// 0x0060
struct FStanceTransitionData
{
	struct FStanceTransition                           StandToCrouch;                                            // 0x0000(0x0010) (Edit, DisableEditOnInstance)
	struct FStanceTransition                           CrouchToStand;                                            // 0x0010(0x0010) (Edit, DisableEditOnInstance)
	struct FStanceTransition                           StandToProne;                                             // 0x0020(0x0010) (Edit, DisableEditOnInstance)
	struct FStanceTransition                           ProneToStand;                                             // 0x0030(0x0010) (Edit, DisableEditOnInstance)
	struct FStanceTransition                           CrouchToProne;                                            // 0x0040(0x0010) (Edit, DisableEditOnInstance)
	struct FStanceTransition                           ProneToCrouch;                                            // 0x0050(0x0010) (Edit, DisableEditOnInstance)
};

// ScriptStruct TslGame.VaultingTask
// 0x0044
struct FVaultingTask
{
	struct FVector                                     V_Start;                                                  // 0x0000(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     V_Apex;                                                   // 0x000C(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     V_ApexAdditive;                                           // 0x0018(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     V_End;                                                    // 0x0024(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	EVaultAnimType                                     InVaultType;                                              // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bEndToFall;                                               // 0x0031(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0032(0x0002) MISSED OFFSET
	float                                              Direction;                                                // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PlayerSpeed;                                              // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DistanceFromObject;                                       // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0040(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.OverlappingObjectInfo
// 0x0010
struct FOverlappingObjectInfo
{
	class UObject*                                     Target;                                                   // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct TslGame.VaultingHandleInput
// 0x0038
struct FVaultingHandleInput
{
	struct FVector                                     ImpactLocation;                                           // 0x0000(0x000C) (BlueprintVisible, IsPlainOldData)
	struct FVector                                     CapsulePredictedLocation;                                 // 0x000C(0x000C) (BlueprintVisible, IsPlainOldData)
	struct FVector                                     Normal2D;                                                 // 0x0018(0x000C) (BlueprintVisible, IsPlainOldData)
	struct FVector                                     DirectionVector;                                          // 0x0024(0x000C) (BlueprintVisible, IsPlainOldData)
	float                                              JumpDistance;                                             // 0x0030(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bIsForceVault : 1;                                        // 0x0034(0x0001) (BlueprintVisible)
	unsigned char                                      bIsBlockVault : 1;                                        // 0x0034(0x0001) (BlueprintVisible)
	unsigned char                                      bIsBlockClimb : 1;                                        // 0x0034(0x0001) (BlueprintVisible)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0035(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.VaultingHandleResult
// 0x0040
struct FVaultingHandleResult
{
	struct FVector                                     Start;                                                    // 0x0000(0x000C) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FVector                                     End;                                                      // 0x000C(0x000C) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FVector                                     Apex;                                                     // 0x0018(0x000C) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FVector                                     ApexAdditive;                                             // 0x0024(0x000C) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	float                                              Direction;                                                // 0x0030(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              PlayerSpeed2D;                                            // 0x0034(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DistanceFromObject;                                       // 0x0038(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EVaultAnimType                                     VaultType;                                                // 0x003C(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bIsPassed : 1;                                            // 0x003D(0x0001) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bIsClimbing : 1;                                          // 0x003D(0x0001) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bIsEndToFall : 1;                                         // 0x003D(0x0001) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0x2];                                       // 0x003E(0x0002) MISSED OFFSET
};

// ScriptStruct TslGame.ReplicatedSkinItem
// 0x0010
struct FReplicatedSkinItem
{
	class UClass*                                      SkinItemClass;                                            // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                SkinOwnerPlayerId;                                        // 0x0008(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.EquipPosition
// 0x0008
struct FEquipPosition
{
	EEquipSlotID                                       SlotID;                                                   // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                Index;                                                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.ConstraintSlotConfig
// 0x0010
struct FConstraintSlotConfig
{
	EConstraintSlotType                                ConstraintSlotType;                                       // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FEquipPosition                              EquipPosition;                                            // 0x0004(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly)
	EEquipableItemSoundType                            OverrideSoundType;                                        // 0x000C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.TslActionInputCallbackConfig
// 0x0018
struct FTslActionInputCallbackConfig
{
	struct FName                                       ActionName;                                               // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       CallbackName;                                             // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bConsume;                                                 // 0x0010(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EInputEvent>                           InputEvent;                                               // 0x0011(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0012(0x0006) MISSED OFFSET
};

// ScriptStruct TslGame.TslAxisInputCallbackConfig
// 0x0020
struct FTslAxisInputCallbackConfig
{
	struct FName                                       AxisName;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Scale;                                                    // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	struct FName                                       CallbackName;                                             // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bConsume;                                                 // 0x0018(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct TslGame.UmgWidgetBinder
// 0x0018
struct FUmgWidgetBinder
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	struct FName                                       Name;                                                     // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UUserWidget*                                 Parent;                                                   // 0x0010(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.UmgWidgetBinder_Animation
// 0x0008 (0x0020 - 0x0018)
struct FUmgWidgetBinder_Animation : public FUmgWidgetBinder
{
	class UWidgetAnimation*                            CachedAnimation;                                          // 0x0018(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.UmgWidgetBinder_Panel
// 0x0008 (0x0020 - 0x0018)
struct FUmgWidgetBinder_Panel : public FUmgWidgetBinder
{
	class UPanelWidget*                                CachedPanel;                                              // 0x0018(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.UmgWidgetBinder_CanvasPanel
// 0x0008 (0x0028 - 0x0020)
struct FUmgWidgetBinder_CanvasPanel : public FUmgWidgetBinder_Panel
{
	class UCanvasPanel*                                CachedCanvasPanel;                                        // 0x0020(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.UmgWidgetBinder_Gerneral
// 0x0008 (0x0020 - 0x0018)
struct FUmgWidgetBinder_Gerneral : public FUmgWidgetBinder
{
	class UWidget*                                     CachedWidget;                                             // 0x0018(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.UmgWidgetBinder_Border
// 0x0008 (0x0028 - 0x0020)
struct FUmgWidgetBinder_Border : public FUmgWidgetBinder_Panel
{
	class UBorder*                                     CachedBorder;                                             // 0x0020(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.UmgWidgetBinder_Image
// 0x0010 (0x0028 - 0x0018)
struct FUmgWidgetBinder_Image : public FUmgWidgetBinder
{
	class UImage*                                      CachedImage;                                              // 0x0018(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UMaterialInstanceDynamic*                    CachedMaterial;                                           // 0x0020(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct TslGame.UmgWidgetBinder_SizeBox
// 0x0008 (0x0028 - 0x0020)
struct FUmgWidgetBinder_SizeBox : public FUmgWidgetBinder_Panel
{
	class USizeBox*                                    CachedSizeBox;                                            // 0x0020(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.UmgWidgetBinder_TextBlock
// 0x0008 (0x0020 - 0x0018)
struct FUmgWidgetBinder_TextBlock : public FUmgWidgetBinder
{
	class UTextBlock*                                  CachedTextBlock;                                          // 0x0018(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.UmgWidgetBinder_HorizontalBox
// 0x0008 (0x0028 - 0x0020)
struct FUmgWidgetBinder_HorizontalBox : public FUmgWidgetBinder_Panel
{
	class UHorizontalBox*                              CachedHorizontalBox;                                      // 0x0020(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.ParachuteInputData
// 0x0020
struct FParachuteInputData
{
	float                                              InForward;                                                // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              InRight;                                                  // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              CurrentForward;                                           // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              CurrentRight;                                             // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsFast;                                                  // 0x0010(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	float                                              CurrentPitch;                                             // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              CurrentYaw;                                               // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              CurrentRoll;                                              // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.SimulationStep
// 0x0048
struct FSimulationStep
{
	uint16_t                                           SimStep;                                                  // 0x0000(0x0002) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	struct FVector                                     Position;                                                 // 0x0004(0x000C) (IsPlainOldData)
	struct FRotator                                    Rotation;                                                 // 0x0010(0x000C) (IsPlainOldData)
	struct FVector                                     Velocity;                                                 // 0x001C(0x000C) (IsPlainOldData)
	struct FParachuteInputData                         InputData;                                                // 0x0028(0x0020)
};

// ScriptStruct TslGame.SkydiveRotationSettings
// 0x0018
struct FSkydiveRotationSettings
{
	float                                              RotationTargetAlphaAmplitude;                             // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RotationTargetAlphaSpeed;                                 // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RotationTargetAlphaPower;                                 // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseExponentialInterpolation;                             // 0x000C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseExponentialRotationClamp;                             // 0x000D(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x000E(0x0002) MISSED OFFSET
	float                                              RotationSpeedExponential;                                 // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RotationSpeedConstant;                                    // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SkydiveDragSettings
// 0x0014
struct FSkydiveDragSettings
{
	float                                              DragScale;                                                // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SpeedMinMap;                                              // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SpeedMaxMap;                                              // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForwardInputMinScalar;                                    // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForwardInputMaxScalar;                                    // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SkydiveLateralSettings
// 0x0020
struct FSkydiveLateralSettings
{
	float                                              LateralAccelScale;                                        // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   AccelInputInMap;                                          // 0x0004(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   AccelInputOutMap;                                         // 0x000C(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxLatVelocity;                                           // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   SpeedScalarOutMap;                                        // 0x0018(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.FreefallVelocitySettings
// 0x000C
struct FFreefallVelocitySettings
{
	float                                              SpeedMin;                                                 // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SpeedMax;                                                 // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SpeedDefault;                                             // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SkydiveVelocitySettings
// 0x0030
struct FSkydiveVelocitySettings
{
	struct FVector2D                                   MinMaxDiveAngle;                                          // 0x0000(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   SpeedScaleOutMap;                                         // 0x0008(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   InputMapScalar;                                           // 0x0010(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityTransferScalar;                                   // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   PitchScalarInMap;                                         // 0x001C(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   PitchScalarOutMap;                                        // 0x0024(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              MinDiveAngleLateralInputScalar;                           // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SkydiveInputSettings
// 0x0028
struct FSkydiveInputSettings
{
	float                                              InputAccelSpeed;                                          // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InputBrakeSpeed;                                          // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InputLateralSpeed;                                        // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InputPitchSpeed;                                          // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InputVelocitySpeed;                                       // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               InputAccelInterpLinear;                                   // 0x0014(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               InputBrakeInterpLinear;                                   // 0x0015(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               InputLateralInterpLinear;                                 // 0x0016(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               InputPitchInterpLinear;                                   // 0x0017(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParaSlowInputForward;                                     // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParaSlowInputRightScalar;                                 // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParaSlowSideInputInterp;                                  // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParaFastSideInputInterp;                                  // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SkydiveCameraBlendSettings
// 0x0010
struct FSkydiveCameraBlendSettings
{
	float                                              BlendInTime;                                              // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EViewTargetBlendFunction>              BlendFunction;                                            // 0x0004(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	float                                              BlendExponent;                                            // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bLockOutgoing;                                            // 0x000C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.ParachuteGeneralSettings
// 0x00D0
struct FParachuteGeneralSettings
{
	float                                              TraceSphereRadius;                                        // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     TraceSphereOffset;                                        // 0x0004(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              GroundTraceStart;                                         // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GroundTraceEnd;                                           // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GroundTraceDampingMin;                                    // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GroundTraceDampingMax;                                    // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LiftScalarInterpSpeed;                                    // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceInterpSpeed;                                         // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LerpDTScalar;                                             // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParachuteForwardVelocityTransferTimeout;                  // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParachuteForwardVelocityTransferTimeoutDTScalar;          // 0x0030(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParachuteInputBlockTime;                                  // 0x0034(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     CapsuleOffset;                                            // 0x0038(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
	class USkeletalMesh*                               ParachuteSK;                                              // 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ParachuteAnimInstance;                                    // 0x0050(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    ParachuteRelativeRotation;                                // 0x0058(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0064(0x0004) MISSED OFFSET
	class FString                                      SkydiveStateManagingWidgetName;                           // 0x0068(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UPhysicsAsset*                               PhysicsAssetRef;                                          // 0x0078(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TMap<ESkydiveState, struct FSkydiveCameraBlendSettings> CameraStateBlendMap;                                      // 0x0080(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct TslGame.ParachuteControlSettings
// 0x0030
struct FParachuteControlSettings
{
	float                                              YawSpeed;                                                 // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxForwardPitch;                                          // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxBackwardPitch;                                         // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollSpeedMin;                                             // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollSpeedMax;                                             // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollAngleMin;                                             // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollAngleMax;                                             // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollInterpSpeed;                                          // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollTendencyRiseSpeed;                                    // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollTendencyFallSpeed;                                    // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PitchTendencyRiseSpeed;                                   // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PitchTendencyFallSpeed;                                   // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ParachuteVelocitySettings
// 0x007C
struct FParachuteVelocitySettings
{
	float                                              ForceForwardScale;                                        // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceForwardYawScalar;                                    // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceForwardStaticSpeed;                                  // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityLERPSpeedMin;                                     // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityLERPSpeedMax;                                     // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityLERPValueMin;                                     // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityLERPValueMax;                                     // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DampingPitchMin;                                          // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DampingPitchMax;                                          // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DampingValueMin;                                          // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DampingValueMax;                                          // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DampingYawScalar;                                         // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   DampingDiveMapIn;                                         // 0x0030(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   DampingDiveMapOut;                                        // 0x0038(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceDownAngleMin;                                        // 0x0040(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceDownAngleMax;                                        // 0x0044(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FinalVelocitySpeedMin;                                    // 0x0048(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FinalVelocitySpeedMax;                                    // 0x004C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FinalVelocityDampingMin;                                  // 0x0050(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FinalVelocityDampingMax;                                  // 0x0054(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceGravityMax;                                          // 0x0058(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceGravitySpeedMin;                                     // 0x005C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceGravitySpeedMax;                                     // 0x0060(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceGravityValueMin;                                     // 0x0064(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceGravityValueMax;                                     // 0x0068(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   BrakeDampingInMap;                                        // 0x006C(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   BrakeDampingOutMap;                                       // 0x0074(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ParachuteDeploySettings
// 0x0010
struct FParachuteDeploySettings
{
	bool                                               bUseAutoDeploy;                                           // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              AutoDeployAltitude;                                       // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseAbsoluteAutoDeployAltitude;                           // 0x0008(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	float                                              StartDeployAltitude;                                      // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ParachuteCutoffSettings
// 0x0050
struct FParachuteCutoffSettings
{
	float                                              ManualCutoffAltitude;                                     // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AutoCutoffDistance;                                       // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AutoCutoffSpeedDistanceScalar;                            // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseManualCutInputDampening;                              // 0x000C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
	float                                              ManualCutInputScale;                                      // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseAutoCutInputDampening;                                // 0x0014(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	float                                              AutoCutInputScale;                                        // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     CutoffSpeedScalar;                                        // 0x001C(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              ManualCutoffCheckTime;                                    // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AutoCutoffVelocityDistance;                               // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CutoffReadyDuration;                                      // 0x0030(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseAutoCutoffVelocityTransfer;                           // 0x0034(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0035(0x0003) MISSED OFFSET
	struct FVector                                     AutoCutoffVelocityScalar;                                 // 0x0038(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseCutoffBeforeImpact;                                   // 0x0044(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0045(0x0003) MISSED OFFSET
	float                                              AutoCutoffAnimTime;                                       // 0x0048(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MeshRotationResetStep;                                    // 0x004C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ExtCollisionShape
// 0x0014
struct FExtCollisionShape
{
	bool                                               bIsSphere;                                                // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              Radius;                                                   // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     Extent;                                                   // 0x0008(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ParachuteOverlapSettings
// 0x0020
struct FParachuteOverlapSettings
{
	struct FVector                                     LocalOffset;                                              // 0x0000(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FExtCollisionShape                          CollisionShape;                                           // 0x000C(0x0014) (Edit, DisableEditOnInstance)
};

// ScriptStruct TslGame.ParachuteLandingData
// 0x0030
struct FParachuteLandingData
{
	EParachuteLandingSurfaceType                       LandingSurfaceType;                                       // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              LandingSpeedLimit;                                        // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                LocalLandingMontage;                                      // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                RemoteLandingMontage;                                     // 0x0010(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseRotationLock;                                         // 0x0018(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0019(0x0003) MISSED OFFSET
	float                                              RotationLockTime;                                         // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                ParachuteCollapseMontage;                                 // 0x0020(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       LandingName;                                              // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ParachuteLandSettings
// 0x0018
struct FParachuteLandSettings
{
	TArray<struct FParachuteLandingData>               LandingTypeArray;                                         // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UAnimMontage*                                ManualDetachMontage;                                      // 0x0010(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SkydiveNetInterpSettings
// 0x0028
struct FSkydiveNetInterpSettings
{
	float                                              FreefallLocationInterpSpeedExp;                           // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParachuteLocationInterpSpeedExp;                          // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParachuteRotationInterpSpeedExp;                          // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   HeightInterpSpeedInMap;                                   // 0x000C(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   HeightInterpSpeedOutMap;                                  // 0x0014(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              LowAltitudeRepRate;                                       // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RemoteFreefallMeshInterpSpeed;                            // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxAllowedLandingPositionDelta;                           // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SkydiveEffects
// 0x0058
struct FSkydiveEffects
{
	class UParticleSystem*                             FreefallEffect;                                           // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UParticleSystem*                             ParachuteEffect;                                          // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   EffectSpeedMapIn;                                         // 0x0010(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   EffectSpeedMapOut;                                        // 0x0018(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   EffectAltitudeMapIn;                                      // 0x0020(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   EffectAltitudeMapOut;                                     // 0x0028(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   EffectDeployMapIn;                                        // 0x0030(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   EffectDeployMapOut;                                       // 0x0038(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      FreefallCameraShakeClass;                                 // 0x0040(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ParachuteCameraShakeClass;                                // 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UCurveVector*                                SkydiveCameraShakeCurve;                                  // 0x0050(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SkydiveAudioSettings
// 0x0078
struct FSkydiveAudioSettings
{
	float                                              AudioVol;                                                 // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class UAkAudioEvent*                               FreefallLoop;                                             // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               ParachuteLoop;                                            // 0x0010(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               SkydiveStop;                                              // 0x0018(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       VelocityRTPCName;                                         // 0x0020(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       VelocityDeltaRTPCName;                                    // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       AccelRTPCName;                                            // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       BrakeRTPCName;                                            // 0x0038(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       PitchRTPCName;                                            // 0x0040(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       TurnRTPCName;                                             // 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       AltitudeRTPCName;                                         // 0x0050(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityInterpSpeed;                                      // 0x0058(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityDeltaInterpSpeed;                                 // 0x005C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AccelInterpSpeed;                                         // 0x0060(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BrakeInterpSpeed;                                         // 0x0064(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PitchInterpSpeed;                                         // 0x0068(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TurnInterpSpeed;                                          // 0x006C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AltitudeInterpSpeed;                                      // 0x0070(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0074(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.SkydiveDamageSettings
// 0x0048
struct FSkydiveDamageSettings
{
	bool                                               bApplyLandingDamage;                                      // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FVector2D                                   NormalInMap;                                              // 0x0004(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   NormalOutMap;                                             // 0x000C(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   VelocityDotScaleInMap;                                    // 0x0014(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   VelocityDotScaleOutMap;                                   // 0x001C(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   VelocityDamageInMap;                                      // 0x0024(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   VelocityDamageOutMap;                                     // 0x002C(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	class UClass*                                      DamageType;                                               // 0x0038(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FallDamageBlockTime;                                      // 0x0040(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.LoadingScreenTypePercent
// 0x0008
struct FLoadingScreenTypePercent
{
	ELoadingScreenType                                 LoadingScreenType;                                        // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              Percent;                                                  // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.LoadingScreenTypePercentConfig
// 0x0040
struct FLoadingScreenTypePercentConfig
{
	TArray<struct FLoadingScreenTypePercent>           LoadingScreenTypePercentForElementaryRank;                // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FLoadingScreenTypePercent>           LoadingScreenTypePercentForIntermediateRank;              // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FLoadingScreenTypePercent>           LoadingScreenTypePercentForHighRank;                      // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FLoadingScreenTypePercent>           LoadingScreenTypePercentForExpertRank;                    // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct TslGame.ElementaryRankGuidePercentConfig
// 0x0010 (0x0018 - 0x0008)
struct FElementaryRankGuidePercentConfig : public FTableRowBase
{
	float                                              ShowElementaryRankPercentForElementaryRank;               // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ShowElementaryRankPercentForIntermediateRank;             // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ShowElementaryRankPercentForHighRank;                     // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ShowElementaryRankPercentForExpertRank;                   // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.BoneBinding
// 0x0010
struct FBoneBinding
{
	struct FName                                       ImpactBone;                                               // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       ReactionBone;                                             // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ChineseLicensingDefaultCustomizeData
// 0x0018
struct FChineseLicensingDefaultCustomizeData
{
	class FString                                      CustomizableObjectGroupName;                              // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	class UClass*                                      EquipableItem;                                            // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.InteractionCollisionData
// 0x0014
struct FInteractionCollisionData
{
	float                                              CapsuleHalfHeight;                                        // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              CapsuleRadius;                                            // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     CapsuleOffset;                                            // 0x0008(0x000C) (Edit, IsPlainOldData)
};

// ScriptStruct TslGame.LevelLoadingBoostParameters
// 0x0010
struct FLevelLoadingBoostParameters
{
	float                                              AsyncLoadingTimeLimit;                                    // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              PriorityAsyncLoadingExtraTime;                            // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              LevelStreamingActorsUpdateTimeLimit;                      // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                LevelStreamingComponentsRegistrationGranularity;          // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.NearClippingValue
// 0x0008
struct FNearClippingValue
{
	ENearClippingLevel                                 Level;                                                    // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              Value;                                                    // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.CustomizableCategoryData
// 0x0030
struct FTslGame_FCustomizableCategoryData
{
	struct FText                                       DisplayName;                                              // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FName                                       Category;                                                 // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FName>                               NotDuplicateCategoryNames;                                // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct TslGame.CustomizableActionName
// 0x0028
struct FCustomizableActionName
{
	struct FName                                       Category;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       ActionName;                                               // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FText                                       DisplayName;                                              // 0x0010(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
};

// ScriptStruct TslGame.CustomizableAxisName
// 0x0030
struct FTslGame_FCustomizableAxisName
{
	struct FName                                       Category;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       AxisName;                                                 // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FText                                       DisplayName;                                              // 0x0010(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	float                                              Scale;                                                    // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.CustomizableMouseSensitiveName
// 0x0028
struct FCustomizableMouseSensitiveName
{
	struct FText                                       DisplayName;                                              // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FName                                       MouseSensitiveName;                                       // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MouseSensitivity;                                         // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.NamedFovRecord
// 0x0010
struct FNamedFovRecord
{
	struct FName                                       SensitiveName;                                            // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FOV;                                                      // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.CustomizableGamePadSensitiveName
// 0x0030
struct FCustomizableGamePadSensitiveName
{
	struct FText                                       DisplayName;                                              // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FName                                       GamePadSensitiveName;                                     // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GamePadSensitivity;                                       // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
	class UCurveFloat*                                 GamePadCurve;                                             // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SurportQualityLevel
// 0x0020
struct FSurportQualityLevel
{
	int                                                QualityLevel;                                             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FText                                       DisplayQualityLevelName;                                  // 0x0008(0x0018) (Edit, BlueprintVisible)
};

// ScriptStruct TslGame.ScreenResolution
// 0x0008
struct FScreenResolution
{
	int                                                Width;                                                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Height;                                                   // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.AimAcceleration
// 0x0008
struct FAimAcceleration
{
	class UCurveFloat*                                 RampUpTimeForTargetingCurve;                              // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.ColorBlindType
// 0x0020
struct FColorBlindType
{
	EColorBlindType                                    Key;                                                      // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FText                                       DisplayName;                                              // 0x0008(0x0018) (Edit, BlueprintVisible)
};

// ScriptStruct TslGame.PresetColor
// 0x0038
struct FPresetColor
{
	struct FLinearColor                                Color;                                                    // 0x0000(0x0010) (Edit, BlueprintVisible, IsPlainOldData)
	struct FText                                       DisplayName;                                              // 0x0010(0x0018) (Edit, BlueprintVisible)
	class FString                                      ColorString;                                              // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct TslGame.ColorBlindColorData
// 0x0014
struct FColorBlindColorData
{
	EColorBlindType                                    Type;                                                     // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FLinearColor                                Color;                                                    // 0x0004(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ColorBlindColorSet
// 0x0010
struct FColorBlindColorSet
{
	TArray<struct FColorBlindColorData>                ColorSet;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct TslGame.ReticleColors
// 0x0018
struct FReticleColors
{
	EReticleType                                       ReticleType;                                              // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FColorBlindColorSet                         ColorSet;                                                 // 0x0008(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
};

// ScriptStruct TslGame.KeyInputModeName
// 0x0020
struct FKeyInputModeName
{
	struct FName                                       ModeName;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FText                                       DisplayName;                                              // 0x0008(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
};

// ScriptStruct TslGame.UiType
// 0x0028
struct FUiType
{
	struct FText                                       DisplayUiName;                                            // 0x0000(0x0018) (Edit, BlueprintVisible)
	class FString                                      UiKey;                                                    // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct TslGame.TeamColorAndIcon
// 0x0040
struct FTeamColorAndIcon
{
	struct FColorBlindColorSet                         TeamMemberColor;                                          // 0x0000(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture*                                    MarkerColorTextIcon;                                      // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture*                                    MarkerIcon;                                               // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture*                                    PlayerIcon;                                               // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture*                                    CompassIcon;                                              // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture*                                    IndicatorIcon;                                            // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture*                                    MapDeathIcon;                                             // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.OverrideScalabilityValue
// 0x0028
struct FOverrideScalabilityValue
{
	class FString                                      ConsoleName;                                              // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	EValueType                                         ValueType;                                                // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0011(0x0007) MISSED OFFSET
	TArray<class FString>                              Values;                                                   // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct TslGame.OverrideScalability
// 0x0018
struct FOverrideScalability
{
	EQualityType                                       QualityType;                                              // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	TArray<struct FOverrideScalabilityValue>           OverrideScalabilityValues;                                // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct TslGame.ReportCauseData
// 0x0038
struct FReportCauseData
{
	struct FText                                       DisplayName;                                              // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	EReportCause                                       ReportCauseType;                                          // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
	TArray<EReportDetailCauseType>                     DetailCauseTypeList;                                      // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	EOptionExposeType                                  ExposeType;                                               // 0x0030(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
};

// ScriptStruct TslGame.SubjectToReport
// 0x0020
struct FSubjectToReport
{
	struct FText                                       DisplayName;                                              // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	ESubjectToReport                                   SubjectToReportType;                                      // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct TslGame.ReportDetailCauseTypeDescription
// 0x0020
struct FReportDetailCauseTypeDescription
{
	EReportDetailCauseType                             ReportDetailCauseType;                                    // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FText                                       Description;                                              // 0x0008(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
};

// ScriptStruct TslGame.TslGamepadInputKey
// 0x0028
struct FTslGamepadInputKey
{
	struct FKey                                        Key;                                                      // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	EGamepadInputResponseTypes                         ResponseType;                                             // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0019(0x0003) MISSED OFFSET
	float                                              ResponseTime;                                             // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bBlockDuplicatedKeyAction;                                // 0x0020(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
};

// ScriptStruct TslGame.TslGamepadActionKeyData
// 0x0080
struct FTslGamepadActionKeyData
{
	struct FName                                       ActionName;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FText                                       DisplayName;                                              // 0x0008(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	class FString                                      Comment;                                                  // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FText                                       Desc;                                                     // 0x0030(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	class FString                                      Category;                                                 // 0x0048(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FTslGamepadInputKey                         GamepadActionKey;                                         // 0x0058(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct TslGame.TslGamepadAxisKeyData
// 0x0040
struct FTslGamepadAxisKeyData
{
	struct FName                                       AxisName;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FText                                       DisplayName;                                              // 0x0008(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	float                                              Scale;                                                    // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
	struct FKey                                        GamepadAxisKey;                                           // 0x0028(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct TslGame.TslGamepadKeyPreset
// 0x0028
struct FTslGamepadKeyPreset
{
	struct FName                                       PresetName;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<struct FTslGamepadActionKeyData>            ActionKeyDatas;                                           // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FTslGamepadAxisKeyData>              AxisKeyDatas;                                             // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct TslGame.AimAssistData
// 0x0030
struct FAimAssistData
{
	float                                              MinDistance;                                              // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxDistance;                                              // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TrackingModifier;                                         // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AdhesionSpeed;                                            // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeadZoneValue;                                            // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseTrackingModifierCurve;                                // 0x0014(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	class UCurveFloat*                                 TrackingModifierCurve;                                    // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseAdhesionSpeedCurve;                                   // 0x0020(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	class UCurveFloat*                                 AdhesionSpeedCurve;                                       // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.AnimatableCustomizableObjectData
// 0x0018
struct FAnimatableCustomizableObjectData
{
	EAnimatableCustomizableTypes                       ParamType;                                                // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	TArray<struct FName>                               AnimatableCustomizableObjectNames;                        // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct TslGame.OptionContentDesc
// 0x0068
struct FOptionContentDesc
{
	struct FName                                       OptionName;                                               // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FText                                       DisplayName;                                              // 0x0008(0x0018) (Edit)
	struct FText                                       DescText;                                                 // 0x0020(0x0018) (Edit)
	EOptionExposeType                                  ExposeType;                                               // 0x0038(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bIsStepper;                                               // 0x0039(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x003A(0x0006) MISSED OFFSET
	TArray<struct FText>                               StepperContents;                                          // 0x0040(0x0010) (Edit, ZeroConstructor)
	int                                                StepperDefaultIndex;                                      // 0x0050(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bIsSlider;                                                // 0x0054(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0055(0x0003) MISSED OFFSET
	float                                              SliderMin;                                                // 0x0058(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SliderMax;                                                // 0x005C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SliderDefaultValue;                                       // 0x0060(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bIsSeparator;                                             // 0x0064(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bIsPalette;                                               // 0x0065(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x0066(0x0002) MISSED OFFSET
};

// ScriptStruct TslGame.GamepadReportStepperDesc
// 0x0038
struct FGamepadReportStepperDesc
{
	struct FName                                       OptionName;                                               // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FText                                       DisplayName;                                              // 0x0008(0x0018) (Edit)
	struct FText                                       DescText;                                                 // 0x0020(0x0018) (Edit)
};

// ScriptStruct TslGame.TeamColorAndName
// 0x0028
struct FTeamColorAndName
{
	struct FText                                       ColorNameText;                                            // 0x0000(0x0018) (Edit)
	struct FLinearColor                                Color;                                                    // 0x0018(0x0010) (Edit, IsPlainOldData)
};

// ScriptStruct TslGame.TslKeyIconData
// 0x0030
struct FTslKeyIconData
{
	struct FKey                                        Key;                                                      // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class UTexture*                                    KeyIcon;                                                  // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture*                                    KeyIcon_PS;                                               // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              IconRatio;                                                // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.TextureAndRatio
// 0x0010
struct FTextureAndRatio
{
	class UTexture*                                    Texture;                                                  // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Ratio;                                                    // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.ItemOffsetData
// 0x0118
struct FItemOffsetData
{
	struct FVector                                     SlotOffset_Primary_Location;                              // 0x0000(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     SlotOffset_Secondary_Location;                            // 0x000C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     SlotOffset_SideArm_Location;                              // 0x0018(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     SlotOffset_Melee_Location;                                // 0x0024(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     SlotOffset_Thrown_Location;                               // 0x0030(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    SlotOffset_Primary_Rotation;                              // 0x003C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    SlotOffset_Secondary_Rotation;                            // 0x0048(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    SlotOffset_SideArm_Rotation;                              // 0x0054(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    SlotOffset_Melee_Rotation;                                // 0x0060(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    SlotOffset_Thrown_Rotation;                               // 0x006C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	TMap<class UClass*, struct FTransform>             SlotOffset_Primary_PerWeapon;                             // 0x0078(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TMap<class UClass*, struct FTransform>             SlotOffset_Secondary_PerWeapon;                           // 0x00C8(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct TslGame.TslKillCauserData
// 0x0030
struct FTslKillCauserData
{
	class ATslPlayerState*                             KillCauserPlayerState;                                    // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UClass*                                      DamageCauserClass;                                        // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FReplicatedSkinParam                        ReplicatedSkinParam;                                      // 0x0010(0x0020) (Transient)
};

// ScriptStruct TslGame.BuffWithBoostGauge
// 0x0018
struct FBuffWithBoostGauge
{
	float                                              BoostGauge;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class UClass*                                      Buff;                                                     // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       OverlapId;                                                // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.CharacterAnim
// 0x0010
struct FCharacterAnim
{
	class UAnimMontage*                                PickUpAnim;                                               // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                DeathAnim;                                                // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.CustomCarepackageCircleData
// 0x0008
struct FCustomCarepackageCircleData
{
	int                                                AddWhiteZoneCarepackages;                                 // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                AddOutsideZoneCarepackages;                               // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.CustomCarepackageComing
// 0x0020
struct FCustomCarepackageComing
{
	class FString                                      CallerAccountID;                                          // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate, EditConst)
	struct FVector2D                                   DropPosition;                                             // 0x0010(0x0008) (IsPlainOldData)
	bool                                               bCustomPackage;                                           // 0x0018(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0019(0x0003) MISSED OFFSET
	int                                                PackID;                                                   // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
};

// ScriptStruct TslGame.ParticleParameter
// 0x0018
struct FParticleParameter
{
	class FString                                      Name;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              Value;                                                    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bEnableRTPC;                                              // 0x0014(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.PackagedItemInfo
// 0x0010
struct FPackagedItemInfo
{
	class UClass*                                      ItemType;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                Count;                                                    // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.TslGameOptionKeyBindingDesc
// 0x0018
struct FTslGameOptionKeyBindingDesc
{
	ETslGameOptionKeyBindingType                       Type;                                                     // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FName                                       InputName;                                                // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InputAxisScale;                                           // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.TslGameOptionForbiddenKeyData
// 0x0010
struct FTslGameOptionForbiddenKeyData
{
	TArray<struct FKey>                                ForbiddenKeys;                                            // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct TslGame.TslGamepadInputKeySet
// 0x0010
struct FTslGamepadInputKeySet
{
	TArray<struct FTslGamepadInputKey>                 GamepadInputKeys;                                         // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct TslGame.StartModeProperties
// 0x0040
struct FStartModeProperties
{
	float                                              TimeLimitSeconds;                                         // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LastRespawnTimeSeconds;                                   // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<int>                                        TeamIds;                                                  // 0x0008(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<int>                                        TeamIndices;                                              // 0x0018(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<class FString>                              TeamLeaderNames;                                          // 0x0028(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	int                                                TeamCount;                                                // 0x0038(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.HealthColorData
// 0x0018
struct FHealthColorData
{
	struct FFloatInterval                              HealthPercentRange;                                       // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FLinearColor                                Color;                                                    // 0x0008(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.HornPlayInfo
// 0x0008
struct FHornPlayInfo
{
	bool                                               bMakeSureDirty;                                           // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	EHornSoundType                                     HornSoundType;                                            // 0x0001(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	float                                              KeyPressedTime;                                           // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.HornSoundInfo
// 0x0010
struct FHornSoundInfo
{
	class UAkAudioEvent*                               HornOnSound;                                              // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               HornOffSound;                                             // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.DecalEffectData
// 0x0038
struct FDecalEffectData
{
	class UMaterial*                                   Material;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FFloatRange                                 Size;                                                     // 0x0008(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFloatRange                                 NormalFadeAngle;                                          // 0x0018(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	float                                              FadeScreenSize;                                           // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FadeStartDelay;                                           // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FadeDuration;                                             // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseRandomInput;                                          // 0x0034(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseRandomRoll;                                           // 0x0035(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bReversal;                                                // 0x0036(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0037(0x0001) MISSED OFFSET
};

// ScriptStruct TslGame.DecalEffectDataSet
// 0x0428
struct FDecalEffectDataSet
{
	struct FDecalEffectData                            DefaultDecal;                                             // 0x0000(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            ConcreteDecal;                                            // 0x0038(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            RockDecal;                                                // 0x0070(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            DirtDecal;                                                // 0x00A8(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            WaterDecal;                                               // 0x00E0(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            MetalDecal;                                               // 0x0118(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            WoodDecal;                                                // 0x0150(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            GlassDecal;                                               // 0x0188(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            GrassDecal;                                               // 0x01C0(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            FleshDecal;                                               // 0x01F8(0x0038) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDecalEffectData                            MudDecal;                                                 // 0x0230(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            CropsDecal;                                               // 0x0268(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            CactusDecal;                                              // 0x02A0(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            PaperDecal;                                               // 0x02D8(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            RubberDecal;                                              // 0x0310(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            FabricDecal;                                              // 0x0348(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            SnowDecal;                                                // 0x0380(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            SnowRockDecal;                                            // 0x03B8(0x0038) (Edit, DisableEditOnInstance)
	struct FDecalEffectData                            IceDecal;                                                 // 0x03F0(0x0038) (Edit, DisableEditOnInstance)
};

// ScriptStruct TslGame.TslKeyHintData
// 0x0010
struct FTslKeyHintData
{
	EKeyHintType                                       KeyHintType;                                              // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                Priority;                                                 // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTslKeyHintChecker*                          KeyHintChecker;                                           // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.WeatherLevelInfo
// 0x0020
struct FWeatherLevelInfo
{
	class FString                                      WeatherId;                                                // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	int                                                Weight;                                                   // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	struct FName                                       WeatherLevel;                                             // 0x0018(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.TslMenuItemStyle
// 0x01B0 (0x01B8 - 0x0008)
struct FTslMenuItemStyle : public FSlateWidgetStyle
{
	struct FSlateBrush                                 BackgroundBrush;                                          // 0x0008(0x0090) (Edit)
	struct FSlateBrush                                 LeftArrowImage;                                           // 0x0098(0x0090) (Edit)
	struct FSlateBrush                                 RightArrowImage;                                          // 0x0128(0x0090) (Edit)
};

// ScriptStruct TslGame.TslMenuSoundsStyle
// 0x0030 (0x0038 - 0x0008)
struct FTslMenuSoundsStyle : public FSlateWidgetStyle
{
	struct FSlateSound                                 StartGameSound;                                           // 0x0008(0x0018) (Edit)
	struct FSlateSound                                 ExitGameSound;                                            // 0x0020(0x0018) (Edit)
};

// ScriptStruct TslGame.TslMenuStyle
// 0x0210 (0x0218 - 0x0008)
struct FTslMenuStyle : public FSlateWidgetStyle
{
	struct FSlateBrush                                 HeaderBackgroundBrush;                                    // 0x0008(0x0090) (Edit)
	struct FSlateBrush                                 LeftBackgroundBrush;                                      // 0x0098(0x0090) (Edit)
	struct FSlateBrush                                 RightBackgroundBrush;                                     // 0x0128(0x0090) (Edit)
	struct FSlateSound                                 MenuEnterSound;                                           // 0x01B8(0x0018) (Edit)
	struct FSlateSound                                 MenuBackSound;                                            // 0x01D0(0x0018) (Edit)
	struct FSlateSound                                 OptionChangeSound;                                        // 0x01E8(0x0018) (Edit)
	struct FSlateSound                                 MenuItemChangeSound;                                      // 0x0200(0x0018) (Edit)
};

// ScriptStruct TslGame.CustomAnimData
// 0x0088
struct FCustomAnimData
{
	TArray<class UAnimSequenceBase*>                   AnimSeqList;                                              // 0x0000(0x0010) (Edit, ZeroConstructor)
	struct FAlphaBlend                                 BlendIn;                                                  // 0x0010(0x0038) (Edit)
	struct FAlphaBlend                                 BlendOut;                                                 // 0x0048(0x0038) (Edit)
	float                                              PlayRate;                                                 // 0x0080(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	ECustomAnimSlotType                                SlotType;                                                 // 0x0084(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bPlayLowerBodyOnStand;                                    // 0x0085(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAdjustPlayRate;                                          // 0x0086(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bLooping;                                                 // 0x0087(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.NpcMeleeAttackInfo
// 0x0040
struct FNpcMeleeAttackInfo
{
	struct FVector                                     RelativeLocation;                                         // 0x0000(0x000C) (Edit, IsPlainOldData)
	float                                              Radius;                                                   // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DamageTypeClass;                                          // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DamageCheckStartSeconds;                                  // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DamageAmount;                                             // 0x001C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FireDuration;                                             // 0x0020(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              OverrideMovingSpeed;                                      // 0x0024(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              OverrideMovingSpeedDuration;                              // 0x0028(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	class UCurveFloat*                                 OverrideMovingSpeedScaleCurve;                            // 0x0030(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	ENpcWalkingSpeedType                               MovingAttackType;                                         // 0x0038(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bIgnoreDamageAnim;                                        // 0x0039(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bSkipPhysicsRotation;                                     // 0x003A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5];                                       // 0x003B(0x0005) MISSED OFFSET
};

// ScriptStruct TslGame.NpcCustomAnimInfo
// 0x0090
struct FNpcCustomAnimInfo
{
	struct FCustomAnimData                             CustomAnimData;                                           // 0x0000(0x0088) (Transient)
	float                                              AnimDuration;                                             // 0x0088(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                AnimIndex;                                                // 0x008C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct TslGame.NPCDrawMovingInfo
// 0x001C
struct FNPCDrawMovingInfo
{
	struct FVector                                     ActorLocation;                                            // 0x0000(0x000C) (Transient, IsPlainOldData)
	struct FVector                                     MovingDir;                                                // 0x000C(0x000C) (Transient, IsPlainOldData)
	float                                              Speed;                                                    // 0x0018(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct TslGame.PoseSnapshotInfo
// 0x0010
struct FPoseSnapshotInfo
{
	struct FName                                       SnapshotName;                                             // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              BlendOutTime;                                             // 0x0008(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bActiveOnRendered;                                        // 0x000C(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.NpcDamageProperties
// 0x0010
struct FNpcDamageProperties
{
	float                                              ImpulsePowerRatio;                                        // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              KnockbackSpeed;                                           // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              KnockbackDuration;                                        // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MultiplySpeedRatio;                                       // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.NpcRagdollProperties
// 0x0010
struct FNpcRagdollProperties
{
	float                                              LinearSpeedRatio;                                         // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LinearZSpeedRatio;                                        // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ImpulsePowerRatio;                                        // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bTermBodyOnRagdoll;                                       // 0x000C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.NpcDamageZoneDesc
// 0x0118
struct FNpcDamageZoneDesc
{
	float                                              GlobalMultiplier;                                         // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TMap<struct FName, float>                          BonesMultipliers;                                         // 0x0008(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	TMap<EWeaponClass, struct FNpcDamageProperties>    DamageProperties;                                         // 0x0058(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	TMap<EWeaponClass, struct FNpcRagdollProperties>   RagdollProperties;                                        // 0x00A8(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              RagdollLinearSpeed;                                       // 0x00F8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RagdollLinearZSpeed;                                      // 0x00FC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RagdollImpulsePower;                                      // 0x0100(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RagdollImpulseDuration;                                   // 0x0104(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DamageImpulsePower;                                       // 0x0108(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DamageImpulseDuration;                                    // 0x010C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ImpulseWeight;                                            // 0x0110(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EDamageReason                                      DamageReason;                                             // 0x0114(0x0001) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               bUsingMovingSpeedOnRagdoll;                               // 0x0115(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0116(0x0002) MISSED OFFSET
};

// ScriptStruct TslGame.MatchPreparerClass
// 0x0010
struct FMatchPreparerClass
{
	EMatchStartType                                    Type;                                                     // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class UClass*                                      Class;                                                    // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ModeStringParameter
// 0x0020
struct FModeStringParameter
{
