#pragma once

// PUBG FULL SDK - Generated By Respecter (5.3.4.11 [06/03/2019]) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "PUBG_TslCaptureLobby_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// BlueprintGeneratedClass TslCaptureLobby.TslCaptureLobby_C
// 0x007E (0x0466 - 0x03E8)
class ATslCaptureLobby_C : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x03E8(0x0008) (Transient, DuplicateTransient)
	class ALobbyViewMode_C*                            ViewModeStudio;                                           // 0x03F0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	class ATslWeapon*                                  TslWeapon;                                                // 0x03F8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	struct FTransform                                  UiCameraTM;                                               // 0x0400(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	struct FTransform                                  ViewModeTM;                                               // 0x0430(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	bool                                               bLeft;                                                    // 0x0460(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Bright;                                                   // 0x0461(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUp;                                                      // 0x0462(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDown;                                                    // 0x0463(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AddView;                                                  // 0x0464(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               MinusView;                                                // 0x0465(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("BlueprintGeneratedClass TslCaptureLobby.TslCaptureLobby_C");
		return ptr;
	}


	void InpActEvt_Backslash_K2Node_InputKeyEvent_26(struct FKey* Key);
	void InpActEvt_Left_K2Node_InputKeyEvent_25(struct FKey* Key);
	void InpActEvt_Left_K2Node_InputKeyEvent_24(struct FKey* Key);
	void InpActEvt_Right_K2Node_InputKeyEvent_23(struct FKey* Key);
	void InpActEvt_Right_K2Node_InputKeyEvent_22(struct FKey* Key);
	void InpActEvt_Up_K2Node_InputKeyEvent_21(struct FKey* Key);
	void InpActEvt_Up_K2Node_InputKeyEvent_20(struct FKey* Key);
	void InpActEvt_Down_K2Node_InputKeyEvent_19(struct FKey* Key);
	void InpActEvt_Down_K2Node_InputKeyEvent_18(struct FKey* Key);
	void InpActEvt_LeftBracket_K2Node_InputKeyEvent_17(struct FKey* Key);
	void InpActEvt_LeftBracket_K2Node_InputKeyEvent_16(struct FKey* Key);
	void InpActEvt_RightBracket_K2Node_InputKeyEvent_15(struct FKey* Key);
	void InpActEvt_RightBracket_K2Node_InputKeyEvent_14(struct FKey* Key);
	void ReceiveTick(float* DeltaSeconds);
	void ExecuteUbergraph_TslCaptureLobby(int* EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
